{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Xqd0DzHaiyRqVH3WRG7hzg", "review_id": "15SdjuK7DmYqUAj6rjGowg", "stars": 5, "date": "2007-05-17", "text": "dr. goldberg offers everything i look for in a general practitioner.  he's nice and easy to talk to without being patronizing; he's always on time in seeing his patients; he's affiliated with a top-notch hospital (nyu) which my parents have explained to me is very important in case something happens and you need surgery; and you can get referrals to see specialists without having to see him first.  really, what more do you need?  i'm sitting here trying to think of any complaints i have about him, but i'm really drawing a blank.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "H1kH6QZV7Le4zqTRNxoZow", "review_id": "RF6UnRTtG7tWMcrO2GEoAg", "stars": 2, "date": "2010-03-22", "text": "Unfortunately, the frustration of being Dr. Goldberg's patient is a repeat of the experience I've had with so many other doctors in NYC -- good doctor, terrible staff.  It seems that his staff simply never answers the phone.  It usually takes 2 hours of repeated calling to get an answer.  Who has time for that or wants to deal with it?  I have run into this problem with many other doctors and I just don't get it.  You have office workers, you have patients with medical needs, why isn't anyone answering the phone?  It's incomprehensible and not work the aggravation.  It's with regret that I feel that I have to give Dr. Goldberg 2 stars.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zvJCcrpm2yOZrxKffwGQLA", "review_id": "-TsVN230RCkLYKBeLsuz7A", "stars": 4, "date": "2012-02-14", "text": "Dr. Goldberg has been my doctor for years and I like him.  I've found his office to be fairly efficient.  Today I actually got to see the doctor a few minutes early!  \n\nHe seems very engaged with his patients and his demeanor is friendly, yet authoritative.    \n\nI'm glad to have Dr. Goldberg as my doctor.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBLW4wJA_fwoWmMhiHRVOA", "review_id": "dNocEAyUucjT371NNND41Q", "stars": 4, "date": "2012-03-02", "text": "Been going to Dr. Goldberg for over 10 years. I think I was one of his 1st patients when he started at MHMG. He's been great over the years and is really all about the big picture. It is because of him, not my now former gyn Dr. Markoff, that I found out I have fibroids. He explores all options with you and is very patient and understanding. He doesn't judge and asks all the right questions. Very thorough and wants to be kept in the loop on every aspect of your medical health and your life.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "zvJCcrpm2yOZrxKffwGQLA", "review_id": "ebcN2aqmNUuYNoyvQErgnA", "stars": 4, "date": "2012-05-15", "text": "Got a letter in the mail last week that said Dr. Goldberg is moving to Arizona to take a new position there in June.  He will be missed very much.  \n\nI think finding a new doctor in NYC that you actually like might almost be as awful as trying to find a date!", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qrs3EICADUKNFoUq2iHStA", "review_id": "_ePLBPrkrf4bhyiKWEn4Qg", "stars": 1, "date": "2013-04-19", "text": "I don't know what Dr. Goldberg was like before  moving to Arizona, but let me tell you, STAY AWAY from this doctor and this office. I was going to Dr. Johnson before he left and Goldberg took over when Johnson left. He is not a caring doctor. He is only interested in the co-pay and having you come in for medication refills every month. He will not give refills and could less about patients's financial situations. Trying to get your 90 days mail away pharmacy prescriptions through this guy is a joke. And to make matters even worse, his office staff is incompetent. 90% of the time when you call the office, they'll put you through to a voice mail, that NO ONE ever answers or returns your call. Both my adult children and husband have decided to leave this practice after experiencing such frustration. The entire office has an attitude like they are doing you a favor. Give me a break! Stay away from this doc and the practice. You deserve better and they will not be there when you really need them. I have never felt compelled to write a bad review about anyone until I met this pathetic excuse for a doctor who is all about the money.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jE5xVugujSaskAoh2DRx3Q", "review_id": "kMu0knsSUFW2DZXqKkGWlg", "stars": 5, "date": "2014-01-02", "text": "Top notch doctor in a top notch practice. Can't say I am surprised when I was referred to him by another doctor who I think is wonderful and because he went to one of the best medical schools in the country. \nIt is really easy to get an appointment. There is minimal wait to be seen and his bedside manner is great.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QnhQ8G51XbUpVEyWY2Km-A", "review_id": "onDPFgNZpMk-bT1zlForRA", "stars": 5, "date": "2014-01-08", "text": "Dr. Eric Goldberg is a fantastic doctor who has correctly diagnosed every issue that my wife and I have had. Unlike many of my past doctors, Dr. Goldberg is very accessible and we have been able to schedule appointments with him and his staff very quickly. We are happy to have him in the neighborhood and look forward to being his patients for many years to come.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tAB7GJpUuaKF4W-3P0d95A", "review_id": "bOJD0Kc3wGioat3oSFqgPQ", "stars": 1, "date": "2014-08-01", "text": "I'm writing this review to give you a heads up before you see this Doctor. The office staff and administration are very unprofessional. I left a message with multiple people regarding my bill, and no one ever called me back. I had to hound them to get an answer about my bill. \n\nSecond, and most important, make sure your insurance is going to cover Dr. Goldberg's visits and blood work. He recommended to me that I get a physical, and he knew I was a student because I told him. I got the physical done. Later, I found out my health insurance doesn't pay for preventative visits. I received an $800.00 bill for the blood work. I can't pay for my bill because I'm a student and don't have any cash flow at this current time. I can't believe the Doctor wouldn't give me a heads up to make sure my insurance would cover work that wasn't necessary and was strictly preventative. The office can't do anything to help me cover the bill. In addition, the office staff said the onus is on me to make sure my insurance covers visits. Frustrating situation!", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uK8tzraOp4M5u3uYrqIBXg", "review_id": "Di3exaUCFNw1V4kSNW5pgA", "stars": 5, "date": "2013-11-08", "text": "All the food is great here. But the best thing they have is their wings. Their wings are simply fantastic!!  The \"Wet Cajun\" are by the best & most popular.  I also like the seasoned salt wings.  Wing Night is Monday & Wednesday night, $0.75 whole wings!\n\nThe dining area is nice. Very family friendly! The bar is very nice is well.  This place is truly a Yinzer's dream!!  \"Pittsburgh Dad\" would love this place n'at!!", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I_47G-R2_egp7ME5u_ltew", "review_id": "0Lua2-PbqEQMjD9r89-asw", "stars": 3, "date": "2014-03-29", "text": "We checked this place out this past Monday for their wing night. We have heard that their wings are great and decided it was finally time to check it out. Their wings are whole wings and crispy, which is a nice change of pace. I got their wet Cajun sauce and garlic butter wings. The Cajun did not have a bold enough flavor for me and their sauce is too thin. The sauce was also thin for the garlic butter, but that is more expected. They were better than average, but I don't like seeing all the sauce resting at the bottom of the boat. I would definitely come try this place out again to sample some of the other items on the menu, but this will probably not become a regular stop for wings anytime soon.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fhNxoMwwTipzjO8A9LFe8Q", "review_id": "XsA6AojkWjOHA4FmuAb8XQ", "stars": 3, "date": "2012-08-19", "text": "Decent range somewhat close to the city.  The mats are pretty solid; however, the grass range needs to be tended too.  It's like hitting out of US Open type rough...not very amenable to practicing.  Which kind of defeats the purpose of going to a golf range...Still gets 3 stars because the range is lit up at night which is excellent for those of us who are addicted to this amazing game, but are somewhat short on time (having a job kinda sucks sometimes, no?).", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-6rEfobYjMxpUWLNxszaxQ", "review_id": "rkD7UDbQ9VM3Va6bI-eBHQ", "stars": 1, "date": "2013-04-18", "text": "Owning a driving range inside the city limits is like a license to print money.  I don't think I ask much out of a driving range.  Decent mats, clean balls and accessible hours.  Hell you need even less people now with the advent of the machine that doles out the balls.  This place has none of them.  It is april and there are no grass tees yet.  BTW they opened for the season this week although it has been golfing weather for a month.  The mats look like the carpet at my 107 year old aunt Irene's house.  Worn and thread bare.  Let's talk about the hours.  This place is equipped with lights yet they only sell buckets of balls until 730.  It is still light out.  Finally lets you have the pit to hit into.  When I arrived I wasn't sure if this was a driving range or an excavation site for a mastodon or a strip mining operation.  There is no grass on the range. Just mud.  Makes it a good tool to figure out how far you actually are hitting the ball.  Oh, they are cash only also.\n\nBottom line, this place sucks.  The best hope is that the owner sells it to someone that actually wants to make money and service golfers in Pittsburgh.", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KZuaJtFindQM9x2ZoMBxcQ", "review_id": "WExNE-f93SL4D1q8s9QWKg", "stars": 1, "date": "2013-07-14", "text": "This place is absolute garbage...  Half of the tees are not available, including all the grass tees.  It is cash only, and they sell the last bucket at 8, despite having lights.  And if you finish even a minute after 8, don't plan on getting a drink.  The vending machines are sold out (of course) and they sell drinks inside, but close the drawers at 8 on the dot.  There are weeds grown all over the place.  I noticed some sort of batting cage, but it looks like those are out of order as well.  Someone should buy this place and turn it into what it should be.", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H9E5VejGEsRhwcbOMFknmQ", "review_id": "iS34GJhMkkt9kCoTJLYEwA", "stars": 4, "date": "2013-08-16", "text": "Before I finally made it over to this range I heard the same thing from most people - it's just fine to go work on your swing. I had such a low expectation I was pleasantly surprised. \n\nIt's a fairly big range - if you are familiar with Scally's in Moon, it seems like it has almost as many tees, though its not nearly as nice a facility. \n\nThe guys in the pro shop were two of the friendlier guys I've come across at ranges or at courses. Yards were indeed marked and there are some targets to aim for, and even some hazards to aim away from. \n\nA big red flag to me was the extra charge ($3) to hit off the grass. I am no range expert, but this is the 4th one I've been to and the first I've seen of that sort of nickel and diming....\n\nPrice for the golf balls was reasonable and I do plan to be back every week until they close up in October for the season. Hopefully, since its for sale, it will reopen as a golf facility again.", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ljwgUJowB69klaR8Au-H7g", "review_id": "S-G0D8Cy7PnqShoBZu8PCA", "stars": 4, "date": "2014-07-11", "text": "I drove by yesterday to get a sneak peak.  It re-opens on July 14th and I can't wait to take my kids.  The new range looks amazing.  The entire range appears to be turf, which may or many not help your game, but it looks really nice.  The tee boxes look state of the art and the club house looks like something you'll see on a newer course.  Can't wait to experience it!", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 3, "useful": 7, "cool": 7}, "user_id": "JbAeIYc89Sk8SWmrBCJs9g", "review_id": "fBQ69-NU9ZyTjjS7Tb5tww", "stars": 5, "date": "2013-06-10", "text": "THANK YOU ROB! i truly appreciated all the help i received from this agent today who was able to removed the extra charges on my bill that the Pasadena Verizon Store on Lake was charging me on my bill for upgrading my phone.   When i went in i was having problems with my Blacberry and had to switch to the Iphone last week. Rob from the Pennsylvania store who i was connected today was able to look at my bill and all the notes and correct the problem immediately. Great Customer Service! He even set up a FOLLOW UP Phone Call with me On July 5th to make sure the credit goes through on my bill...I can't thank him enough!!!!", "type": "review", "business_id": "HZdLhv6COCleJMo7nPl-RA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "l_szjd-ken3ma6oHDkTYXg", "review_id": "CFiLh7WvH7dM3qVZvNiacQ", "stars": 2, "date": "2013-12-23", "text": "After waiting for almost 30 minutes to trade in an old phone part of the buy back program, our customer service rep incorrectly processed the transaction. This led to us waiting another 30 minutes for him to correct it. Don't visit this store if you want pleasant or good service.", "type": "review", "business_id": "HZdLhv6COCleJMo7nPl-RA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zo_soThZw8eVglPbCRNC9A", "review_id": "UzMViMQZuSxOr5wrru3LwQ", "stars": 4, "date": "2014-09-04", "text": "I visited this store several months ago to simply ask about smartphone plans. The agent was pleasant and helpful. I would recommend a visit to this store.", "type": "review", "business_id": "HZdLhv6COCleJMo7nPl-RA"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "LWbYpcangjBMm4KPxZGOKg", "review_id": "6w6gMZ3iBLGcUM4RBIuifQ", "stars": 5, "date": "2012-12-01", "text": "This place was DELICIOUS!!  My parents saw a recommendation to visit this place from Rick Sebak's \"25 Things I Like About Pittsburgh\" and he's usually pretty accurate.  His recommendations were to try the Reuben, Fish Sandwich and Open-Faced Steak Sandwich.  We went early afternoon for a late lunch today (a Saturday) and were seated right away.  The staff is extremely friendly.  My Mom & I each had the fish sandwich, while my Dad & Brother had a Reuben sandwich.  The fish was very good, but the Reuben was to die for!  Both dishes were massive, and could very easily be shared between two people.  On top of being extremely large portions, it was incredibly affordable.  The giant fish sandwich was $8 and the giant Reuben was $7.50.  Our drinks were always filled and we were checked on several times during the meal.  We will definitely be back!!!  Oh and a bit of advice ahead of time - they take CASH ONLY.  So come prepared, but I'm pretty sure I saw an ATM there as well.  And I do believe they are closed on Sundays & Mondays.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "8fApIAMHn2MZJFUiCQto5Q", "review_id": "3Es8GsjkssusYgeU6_ZVpQ", "stars": 5, "date": "2013-03-30", "text": "This place should have a lot more reviews - but I'm glad it doesn't, they don't need to get any busier.\n\nIts been there ages, and looks it. If you're all about ambiance, don't bother. If you pretend you're in a movie set in Pittsburgh 30 years ago it works pretty well. The service is sometimes hit or miss. Most of girls are good, one is very slow, one is amazing. They are all friendly and usually a few different people will check in to make sure that you're happy. Everything is made fresh so be prepared that nothing comes flying out of that kitchen - busy times it can take a good while to get food. \n\nThe food is AWESOME! Worth any little complaints I might think up before it gets there. Once its on the table, I forget them all.\n\n-Fish Sandwiich\n-Salmon (huge and delicious)\n-Flounder\n-Shrimp a few ways (\"Norfolk\" style is oily for my taste, and I never had it growing up in Norfolk.)\n-Hawkins St Special\n-Prime Rib (sized for two, watch it)\n\nThe prices are low, the portions are large, and just about everything on the menu  is delicious. I'm not one to pick a place because they give you a lot of food, but if you like a good value and don't want to compromise on taste, this place is a gem.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uK8tzraOp4M5u3uYrqIBXg", "review_id": "KAkcn7oQP1xX8KsZ-XmktA", "stars": 4, "date": "2013-10-20", "text": "This place was very good. I found out about Emil's when watching a show called \"25 Things I Love About Pittsburgh\" on WQED hosted by Rick Seback. This place ain't a luxurious restaurant...it's a beer & a shot bar / lounge. But the people are friendly & the food is good. I had the fish sandwich which was great. It ain't in a great part of town, Rankin, but I've been in worse places!! Try this place.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6wvlM5L4_EroGXbnb_92xQ", "review_id": "BZNJkkP0bXnwQ2-sCqat2Q", "stars": 5, "date": "2013-11-07", "text": "Old school.....traditional \"mom 'n pop\" quality and perfection. The best fish and chips you'll ever enjoy and equally superb fried shrimp. A great out of the way, non-corporate, vestige of Americana. You will love it.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "345nDw0oC-jOcglqxmzweQ", "review_id": "VDTIbR3G5_IPkpXbo2MutA", "stars": 5, "date": "2014-03-22", "text": "Seen this restaurant on 25 best places in Pittsburgh with Rick Seback\nack. Went there with my girlfriend she grew up with the owner. She's very nice all employees are super nice service was excellent i had the fish sandwich my girlfriend had the Ruben more than you could possibly eat very reasonable prices. Going back to try the burgers  i heard there enormous and very tasty.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u9ULAsnYTdYH65Haj5LMSw", "review_id": "5uyYmniYyIB_wtKtyXDudQ", "stars": 4, "date": "2014-09-29", "text": "Wonderful reuben.  Map shown on Yelp page is incorrect. It is actually a different Hawkins.  I'd recommend a call for directions 412-271-9911.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tAKjY3bQXH51msJbOHYPmQ", "review_id": "uf61rPucuICXhSPXlZ1hIQ", "stars": 5, "date": "2014-11-03", "text": "After a morning of Thrift Store hunting, a friend and I were thinking of lunch, and he suggested Emil's after he'd seen Chris Sebak do a bit on it and had tried it a time or two before, and I had not. He said they had a decent Reuben, but to be prepared to step back in time.\n\nWell, seeing as how I'm kind of addicted to late 40's and early 50's, and the whole Rat Pack scene, stepping back in time is a welcomed change in da burgh...as long as it doesn't involve 1979, which I can see all around me every day.\n\nAnd yet another shot at finding a decent Reuben in da burgh...well, that's like hunting the Holy Grail. So looking under one more bush certainly wouldn't hurt.\n\nSo off we go right at lunchtime in the middle of...where exactly were we? At first I thought we were lost, driving around a handful of very rather dismal looking blocks in what looked like a neighborhood that had been blighted by the building of a highway. And then...AHA! Here it is! And yep, there it was. This little unassuming building with an add-on entrance with what looked like a very old hand painted sign stating quite simply 'Emil's. \n\nWe walked in the front door, and entered another world. Another time, and another place. Oh, and any Big Burrito/Sousa foodies might as well stop reading now. I wouldn't want to see you walk in, roll your eyes and say 'Reaaaaaalllly?'\n\nThis is about as old world bar/lounge/restaurant as it gets. Plain, with a dark wood bar on one side, plain white walls with no yinzer pics, good sturdy chairs and actual white linens on the tables. This is the kind of neighborhood dive that I could see Frank and Dino pulling a few tables together for some poker, a fish sammich, and some cheap scotch. And THAT is exactly what I love.\n\nOh...but good food counts too. \n\nWe each had a Reuben, and my friend had a side of fries. The Reubens were decent, but not NY awesome. A little too thick on the bread, but overall, tasty and definitely filling. Not too skimpy on the meat. I seriously CRAVE a true, good NY Reuben, but since I can't afford to travel right now, what I find in da burgh will have to do. But as we sat and ate, burgers came out to an adjoining table. Those were some big thick burgers. A steak went past for the table behind us. That was HUGE! And when we asked about it, the waitress said 'Yeah, it's huge and really good, and he only charges $12.99 for it, ain't that nuts?' Another table of five came in, and wham. Fish sandwiches PILED with breaded fish that looked amazing. Yeah, I want that, that, that and THAT!\n\nMy friend also mentioned that they have a Chicken Parm special one day of the week that is only served UNTIL 4 pm, and that it is fantastic. If only I could GET there on that week day before 4...\n\nThe waitress did a good job, especially since there was quite a growing crowd at lunchtime on a Saturday, and only one of her. She kept up and was very friendly. \n\nThey only have Pepsi products, so I had a brewed iced tea, which was very fresh, and she did pop by to ask about refills as often as she could. As the lunch hour went on, they were getting busy.\n\nEmil's is no frills, good portions, very reasonable prices, VERY comfortable neighborhood hole in the wall...kind of like Cheers, but in a blue collar neighborhood in the 1950's. Fan-freakin-tastic! I could feel at home here.\n\nYou definitely want to hit Mapquest or plug in your GPS though. I am not sure that I could find it again on my own...it really is a hidden gem. I will be making my friend take me back until I can memorize where the heck it is.\n\nAddendum: 2nd visit for the fish sandwich. Excellent. Truly. A pound of fish on a fish-shaped bun (as opposed to da burgh's seemingly popular hamburger bun). The fish was flavorful, the batter excellent, and for just $8. This may have been the best fish sandwich I've yet to have in da burgh.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "ay9H1RpjbBkaiXGxfh7LaA", "review_id": "v_uEDbK5fP1UJpkXNPwXpQ", "stars": 4, "date": "2010-10-11", "text": "This would be my local haunt, if I were ever to relocate to the Pittsburgh area. What a great little place! Such friendly staff, and some damn good eats!\n \nIt was so great, that we actually went there twice during our 4-day vacation to catch the Steelers/Ravens game. \n\nThey have daily sandwich specials. On Thursday night we went and had the special roast beef and cheese sand., and the .35 cent wings. Very, very tasty. I'm sorry, but this place kicks Primanti Bros. butt on the taste factor. They have about 8 different types of wings... reg., garlic, and I can't remember the rest - we got the regular, and I was wishing we would had ordered more.\n\nGoing back on a Friday night, we ordered the buffalo chicken pizza and a pepperoni n' mushroom.  Wow! That buffalo chicken pizza was awesome.\n\nThe other thing that stuck out for me was one of the customers. An older gentleman; he seemed to be a regular. I really, really wanted his SPAM t-shirt.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "JbWnXwjLaO1kncUkQOMajg", "review_id": "j8GuxQJ_DQsSfrJNkmcACA", "stars": 4, "date": "2011-02-27", "text": "A great townie bar with tasty food and an interesting clientele. I went to check this place out on the way home from the airport one Friday night and it didn't disappoint. It is refreshing to walk into a townie bar and not feel like the music stops and everyone in the place is staring at you - I'm guessing the mixed crowd of older hockey fans, young men in collared shirts, and thirtysomethings have probably seen it all during their time at this place. \n\nThe staff was top notch - the orders were somewhat overwhelming as they appeared short-staffed for the night, but my waitress tried to keep a positive attitude for my entire visit. The other waiter was wearing a hooded cardigan, and I wanted to steal it from him due to my difficulty in finding such a quality article of clothing.\n\nWe ordered a white pizza - large in size, engulfed in cheese, full of garlic flavor, flavorful hot sausage. An overall delicious pizza, aside from 2 things: 1, way too much grease (I know this comes with the territory, but still, it is sometimes unbearable); 2, CANNED MUSHROOMS - the worst thing to come out of a can. Ever. I would rather eat canned Alpo than canned mushrooms. And if the mushrooms weren't canned, they were just the worst mushrooms I've ever consumed. The mushroom debacle is enough to lower the review by an entire star - disgusting!\n\nMy advice for the place is keep everything awesome - random music from the jukebox, tasty food, great prices, good crowd and staff - and get some decent mushrooms; why they spoil an otherwise above average pie with such inferior crap, I'll never know.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4-3IU5uUH90m21TWbZhhnA", "review_id": "2xCds3bp0wM6nHMz3H65vg", "stars": 4, "date": "2011-08-15", "text": "Alexion's has been around forever.  The first time I went in there, I was 19 years old on summer break from college and working at the ice cream factory up the hill.  All of the union guys from the ice cream factory went in there after work, and I immediately found out why.  MANY, MANY years later, I stopped in there with some fond memories, and once again felt welcomed and valued as a customer, even though they didn't know who I was.  THE SANDWICHES are done Pittsburgh-style, sort of like Primanti's, and they are as perfect today as they were back in ancient times when I first started visiting the place.  Alexion's is a clean and peaceful little place in the Rook Station part of Green Tree, the oldest part of the town.  I recall that some of the sandwiches I got there were ordered at a pretty late hour.  Nothing but good things to say about the place, and I wish it was closer to home!", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bcwr1bFov3PSa1FiGfpc9g", "review_id": "UrukGX1emhSRe2fGdxdVPA", "stars": 3, "date": "2011-12-22", "text": "Good for cheap drinks and wings, they offer daily specials which is nice. \n\nDoesnt look like much from outside but the inside is friendly enough, the bartenders have been there for awhile and do a good job. Dont expect to have a HUGE selection of alcohol. \n\nTheir wings are good as are their salads. If you are gluten free this is not your place...lots of fried food and sandwiches. \nOffers a quick lunch.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sjb5e5-gKoLXueFDMc2R8Q", "review_id": "2_Ru_ASf75kU303rdQjFfQ", "stars": 4, "date": "2013-04-25", "text": "What a cool bar/restaurant.. I will no doubt be visiting again.  The service and prices were great.. and the restrooms were clean.   I had the buffalo chicken sandwich and it was delicious.  The menu consists of typical bar food food, however; theres a few different items on there which stand out on the menu..\n\nA cool bar off the beaten path that is a worth a trip.  \n\nCheers ! !", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h-A_xNeB_xSbc0psqHyoJg", "review_id": "0klMyorClST8NYGJqArzPQ", "stars": 5, "date": "2014-02-16", "text": "Grew up near here. the family would always go once a month. Haven't stopped in for a few years until last Friday with a few friends to grab a drink. The sandwiches are always amazing just as I remember. The staff is amazing and friendly. Great place for lunch as well.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GcBAIs4pzeK6OzHpawgZlg", "review_id": "UVx5-SD8RyZu3NPRU5GwZg", "stars": 2, "date": "2014-03-13", "text": "Very disappointed in the customer service. We ordered Reuben's  and wanted coleslaw instead of kraut. They charged us $3.00 for the coleslaw. We will not be back . The iced tea is also terrible tasting.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tkYwzVUMztdjNuqsNhAP5A", "review_id": "alwn7y-xR9ZN-q4_e-n9OA", "stars": 5, "date": "2014-06-27", "text": "Let there be no question: Alexions owns the best cheeseburger in the region and they have now for decades. Try a burger on Italian bread. The service is flawlessly friendly, the food is amazing, and the wings? Oh the wings... but it's still about the cheeseburger. The atmosphere is inviting, but you can't eat atmosphere... so go right now. Grab the car keys... you know you're hungry for an amazing cheeseburger, maybe some wings, and a cold beer! Easily, hands down, the best bar and grill in Pittsburgh.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qswY4Psj6SdtwJABNx0eng", "review_id": "ElQikklZunCiyaOKR4hEaw", "stars": 5, "date": "2014-07-21", "text": "The sandwiches, the wings, enough said. Alexions can best be described as a home-style Primantis before they went mega commercial. You really can't go wrong, but for my money, I would put Alexions fish sandwich up with the best I've had. That's not to take away from other selections, but if you come here I recommend not leaving until you've had either the fish sandwich, Reuben, or wings. \n\nYou'll know you're in a Pittsburgh bar when you walk in. For someone who lives in Atlanta now and only makes it to Pittsburgh a few times a year, I have to say it is refreshing. Feels like home. I haven't had a trip back without making it out to Alexions at least once.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "udy8pMNA09YDs98e51wXZQ", "review_id": "1yRSd1j8gamtcUN9lSZ3Uw", "stars": 3, "date": "2014-08-08", "text": "We met a couple of friends there on a Friday afternoon about 440 pm, based on the Yelp reviews. I've relied on Yelp in over a dozen different cities, never came away with anything less than a positive experience until today. \n\nWe ordered within 5 minutes of sitting down, there couldn't have been more than 20 people in the place, counting the people on the patio.  Took them almost 40 minutes to serve 3 sandwiches and a salad. I tried the fish sandwich, came out fried extra crispy on the ends, if there is such a thing as fish jerky a third of the sandwich would have qualified, it was just ok. I've had better at almost any church that fries fish during Lent. \n\nAll 3 of my dinner companions left partial sandwiches  or salad uneaten. Bread french fries and onion rings were good though. Iced tea was good, though I've never seen a place dispense sweet n low like they were giving away their last rock of crack. Asked for sugar but never saw any, they don't carry any other artificial sweeteners besides the pink stuff.\n\nI may give the place another try in the future for a Reuben or hamburger, assuming today was some aberration possibly due to a cook having a family emergency or something like that. Waitress was pretty good, held up under my multiple requests to find out if they caught my fish yet, hardly ever rolled her eyes :)", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xzie68uK2ViI0ddnLHw1tw", "review_id": "N1O_3yeUB0nn3otEJc88tA", "stars": 1, "date": "2012-12-14", "text": "Used to go there for tires, brakes, etc.  Their prices have gone way up-$400 for 4 mid-level tires for a Toyota.  Plus, 1 of the new tires went flat within 3 weeks.  Since they don\"t make appointments,  the wait to get the tire looked at was ~2 hours.  Sorry--can't wait that long to get a warranted repair,  They lost my business for good.", "type": "review", "business_id": "b12U9TFESStdy7CsTtcOeg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "trYPAmnPz6ChpIgx0jGbyg", "review_id": "DuTV6MVj5qjTJTlpwlUsBw", "stars": 1, "date": "2013-03-21", "text": "I got 'new' tires from them and within two weeks got a flat. I took my car to a local mechanic to see if i could get the hole patched, but they said the reason I had a flat was because the previous patch had blown - WAIT, WHAT? I just got the tire and never needed to have it patched? This was supposed to be a new tire. \nI took the tire over to Flynn's and they told me that someone punctured my tire, then tried to patch it. So there are resentful tire slashers? I find that very unlikely. After arguing with the guy and telling him that his logic was far fetched he said he'd give me a new tire \"this time\". \nI will never go back to Flynn's b/c of the way this guy treated me and the simple fact that they gave me a used tire!", "type": "review", "business_id": "b12U9TFESStdy7CsTtcOeg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XTp6S7yXL7HluVUaBYdbyQ", "review_id": "8rZtuT8USrLQIu5k4LPFKw", "stars": 1, "date": "2013-09-27", "text": "Terrible. Preordered my tires and when I arrived they couldn't find the order anywhere. Once we got through that process I waited over 2 hours for them to be put on... I was originally told it would take 30 mins. Slow, over priced, I'll go elsewhere next time.", "type": "review", "business_id": "b12U9TFESStdy7CsTtcOeg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RsaEvod4EOBYIdbRBBv0sw", "review_id": "ap4IaJaTlj_txbJe99D6oQ", "stars": 4, "date": "2014-02-20", "text": "Contrary to other reviews, I have zero complaints about the service or the prices. I have been getting tire service here for the past 5 years now, and compared to my experience with places like Pep Boys, these guys are experienced and know what they're doing. \nAlso, this is one place that I do not feel like I am being taken advantage of, just because of my gender. Other auto mechanics have been notorious for capitalizing on my ignorance of cars, and have sucked my bank account dry. But here, my service and road coverage has all been well explained - and let up to me to decide. \nAnd they just renovated the waiting room. It looks a lot better than it did in previous years.", "type": "review", "business_id": "b12U9TFESStdy7CsTtcOeg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5noqL9IulqZx326u6eg4Rw", "review_id": "Yip27oh0XMK0_1C3bN_DNA", "stars": 1, "date": "2014-02-27", "text": "Last summer I had an appointment to get new tires and had to wait a super long time. I also went in this week for them to fix a minor problem with a tire they put on. They \"fixed\" it for free, and the very next morning I had the same issue. I called to complain, and the \"manager\" didn't even apologize!!! So frustrated. Never going back.  They seem overpriced, too.", "type": "review", "business_id": "b12U9TFESStdy7CsTtcOeg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "072tu2_MFWmw-jb1O6DQYg", "review_id": "kNAhHVuUzbYt0UG9QqwaCQ", "stars": 4, "date": "2010-03-24", "text": "Most random location for a mini golf course ever.  This is old school. It's built into the woods (spray yourself for bugs first) right off Forsythe Rd near Carnegie Park.  The candy hut is fun to spend your spare change.  They recently re-carpeted the holes and added a few gimmicks that weren't there before.  It won't knock your socks off, but if you're local, give it a try!", "type": "review", "business_id": "Sktj1eHQFuVa-M4bgnEh8g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5eR_TeDFbOmv28MoRwH-lw", "review_id": "apM_3NdKNQjIjRLeFN7vOQ", "stars": 4, "date": "2011-02-25", "text": "This quaint mini golf course is one of the oldest, yet most original and fun locations that I have yet visited.  Coming from Texas, it was nice to see a course located amongst the hilly and woody Pennsylvanian terrain. It can be frustrating that it is literally impossible to make a hole-in-one on most every hole and that the course also makes it extremely difficult to predict the direction on how the ball will follow through and bounce.  The cartoon-like outrageousness of the course proved to give laughs and a fun attempt to play.  Improvements were being made and I will look forward to returning on my next visit to the Pittsburgh area.  I enjoy traveling and visiting new courses and the only reason why I didn't give this location 5 stars is because it was impossible to intuitively shoot the ball for a best effort to beat par.", "type": "review", "business_id": "Sktj1eHQFuVa-M4bgnEh8g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4cW3iQW6JD1C8VxYP0eyXg", "review_id": "o5J7NoSEA-PvkcpMuQn8kg", "stars": 4, "date": "2012-10-29", "text": "I've been informed by a fellow Yelper that they are just closed for the season, I hope they're right! I find it strange they don't keep their phone number in service with a recording and that they didn't cover the course up to protect it from weather, vandalism, etc. Either way, I can't wait to get my game on in the spring!", "type": "review", "business_id": "Sktj1eHQFuVa-M4bgnEh8g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BNiS6iuXJHMqTyuKQgyHYQ", "review_id": "5q5h76tiVrgn5ElyZzpx9Q", "stars": 1, "date": "2014-07-17", "text": "Don't waste your time.  We had two different people come to our house to give us estimates for a deck (one of them the OWNER).  Both times, we never heard from them.  Not a call, not the estimate, nothing.", "type": "review", "business_id": "3ZVKmuK2l7uXPE6lXY4Dbg"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "XW_RwDoN9StbDt0Y1pc3VA", "stars": 3, "date": "2009-12-10", "text": "I have never seen a restaurant that has a frowning brownie (a.k.a. Frownie) as their icon, mascot, or spokesperson.  King's Family Restaurant has surprised me with this.  I think it might be in direct dialogue with Eat N' Parks smiling cookie -- funny (funny odd, not funny ha-ha).  We were seated rather quickly by the manager.  Very nice people work here, I was happy to find that even though they had closed a section, the server was willing to stay longer to serve us our dinner.\n\nWe chatted with the server a little bit -- she was quite engaging -- and then moved on to order our meal:\n\nTea\nPepsi\nOpen-faced Hot Turkey Sandwich with mashed potatoes and gravy\nBuffalo Chicken strips with mashed potatoes and macaroni n' cheese\n\nOur drinks arrived and our server conversed with us some more about the area.  She would leave every couple of minutes to check on our food and to make certain that her other tables had everything they needed.  Eventually, our entrees arrived -- both piping hot.  I went straight for the macaroni and cheese.  It didn't taste bad, but I swear that it is made by Stouffers.  I didn't feel the need to eat that much knowing that there were other things to eat.  I tried the mashed potatoes and found that they too came from a package; but, again, they didn't taste bad with the brown gravy.  I moved on to the main part of my meal -- the buffalo chicken strips.  At least they were all white meat and the buffalo sauce was more than just mild.  I contented myself with eating them.  \n\nI tried some of the hot turkey sandwich and just left the rest for my friend since it was not fresh cut turkey but instead luncheon meat that had been heated.  I finished off my dinner and was happy in the end.  No, it wasn't the best food in the world, but the service greatly helped the perception and it didn't taste bad.", "type": "review", "business_id": "wJr6kSA5dchdgOdwH6dZ2w"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "LaPatM6c289ClpysmzZpdQ", "review_id": "LOqF4d657XomJGRKpFKlhg", "stars": 3, "date": "2010-01-03", "text": "So... back in the late 90s, there used to be this super-kick-ass cinnamon ice cream, like an apple pie ice cream without the apples or the pie crust.  SO DELICIOUS!\n\nHowever, NOW there is some shit-tastic replacement that tastes like vanilla ice cream with last year's red-hot in the middle: totally gross.  Fortunately, our server was nice enough to warn me about the change and bring me a sample, so I only had to suffer the death of a childhood memory rather than also having to pay for it.\n\nThe portions are big and filling, just don't come for the ice cream.", "type": "review", "business_id": "wJr6kSA5dchdgOdwH6dZ2w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vGI3dbg5zFRXBg4eVVmGSg", "review_id": "e2YxtsZJE3w6DdNP8yMs7w", "stars": 4, "date": "2010-11-06", "text": "Ive pretty much been eating at various Kings' pretty regularly since I was a child when my parents would take my sister and I into the Fox Chapel location often.  Lately me and my girl have been visiting the Heidelburg location. I love the food, it really tastes homemade, much like something a grandmother would make, complete with gobs of butter and side dishes. Prices are low, selection is great, but dont expect fine dining by any means. \n\nService is hit or miss at pretty much all of them; if you have lunch at any Kings, you will likely be waited on by a sweet but sarcastic  older lady who has been doing the waiting thing for 30 years and knows her game. Seek out this lady.  My experience with the younger crowd at night isnt the same.\n\nIm in my 30s now, and very little has changed, other than the Fox Chapel location was remodeled about 10 years ago to look less like a diner, which was a big fail.  Any girl I meet has to enjoy Kings or she's out.", "type": "review", "business_id": "wJr6kSA5dchdgOdwH6dZ2w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9MmWbiE7txW_OplDAnoaqA", "review_id": "RRddfCx_goh5UnEIwx9HMA", "stars": 2, "date": "2011-11-21", "text": "Hoofah.", "type": "review", "business_id": "wJr6kSA5dchdgOdwH6dZ2w"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "bgLHVU09FpJ-uEOFFor6uA", "stars": 4, "date": "2012-05-30", "text": "I heart King's. I've always been a fan and this one was as good as my old one in Monaca.", "type": "review", "business_id": "wJr6kSA5dchdgOdwH6dZ2w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7KoVg5QMjYu8taLFSE7hNA", "review_id": "pLkbUd2H5ducEeJPi1BPGw", "stars": 4, "date": "2014-09-18", "text": "I arrived around 10 am on a Saturday morning.  I was greeted by the hostess,who was polite and friendly, and I informed her that I was alone.  She had just arrived, as well, and wasn't exactly sure what was going on yet, so she asked (the manager?) where she should seat me.  After receiving guidance, she brought me to a table towards the back.  It had not yet been cleaned after the previous guests had dined.  So, she quickly got it cleared off, grabbed a rag, and wiped it down.\n\nThe waitress came rather quickly to take my drink order.  She was extremely friendly.  I ordered coffee and water, which she went and got while I looked over the menu.  She returned, and took my order.  I ordered the Cinnamon Swirl French Toast Special - Three slices of French toast made with Pittsburgh's own Jenny Lee® Cinnamon Swirl, two farm-fresh eggs, with bacon or sausage (I chose sausage), and your choice of potato (I went with the cheesy hash brown casserole).  I also added an orange juice.  She went and put my order in, while I waited, and came back with it after not too long.   The eggs were cooked exactly how I wanted them, the cheesy hash brown casserole and the french toast were both delicious.  I also enjoyed the sausage which was pretty typical.\n\nKings Family Restaurant featured a very friendly staff, great prices, and tasty food.  I am pleased and will definitely come back again.", "type": "review", "business_id": "wJr6kSA5dchdgOdwH6dZ2w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G4PZXgVGd-6zG9jJBQNl5A", "review_id": "yJFDmUvxlPRdzG7GPSAXKw", "stars": 5, "date": "2015-01-01", "text": "thisis not the closest Kings to us, but we often will travel the extra miles because the service and food at this location is always the best.", "type": "review", "business_id": "wJr6kSA5dchdgOdwH6dZ2w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "bMCvh40U7J1xu3IwuulAPg", "stars": 3, "date": "2011-03-09", "text": "Not bad for a Shop N Save, most are privately owned, so availability of items might differ from place to place. The only time I frequent S n S is when the have their huge two day sales usually held on Thursday and Friday at least once month.\n\nGood bakery at this location too.", "type": "review", "business_id": "yXuao0pFz1AxB21vJjDf5w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tAKjY3bQXH51msJbOHYPmQ", "review_id": "MsoASFxCmOOkOBOqZ80ngQ", "stars": 2, "date": "2013-09-01", "text": "Two meals, on the recommendation of a friend who lives near the place, and after the second trip, I was compelled to write. 'Rocky' would definitely describe the experiences.\n\nOn the first trip, I went to try their (at that time)raved about Reuben. And YET to find a true good Reuben in da burgh, I tried it.\n\nWell, they were out of the proper bread, and the guy had to run to the store to buy the closest thing he could find, which was not the proper bread, and instead of one of their 'raved about' Reubens, I received two mini-Reubens, which basically took the guts from one Reuben, and spread it out onto two sandwiches on regular sized bread. I ate it. It wasn't great, but they swore it was because they'd run out of the bread. Bread or not, it still wasn't great. The atmosphere was pleasant in that 'blue collar bar' kind of way, and the staff was very nice, but not a winning pitch on the Reuben.\n\nThe second trip was after a long day of moving furniture with the same friend. Sat in the back room, instead of the bar, which felt more like a restaurant, of course, with the big screen TV covering the sports of the moment.\n\nI was in the mood for dinner this time, and after a scan, decided on fried chicken and mashed potatoes with the salad bar. My friend ordered one of her faves, the breaded pork chops.\n\nWe hit the salad bar, which was uber-basic. Three soups (mostly vegetable loaded, which left me out), basic iceberg lettuce mix (very probably out of a bag), a few veggie toppings, and three or four dressings. It was a basic salad, no big deal. More or less an appetizer filler before the meal.\n\nThe mind-blower in this trip was the ordering of the fried chicken dinner. Our waiter looked like a 19 year old gas station attendant, skinny little blonde guy with a sweet but incredibly naive face, and an air of vapidity, which was confirmed when I placed my order. I asked what chicken pieces came in the dinner, and asked if it was possible to only get dark meat. I never imagined how confusing a question that could possibly be. It literally took him two trips back to the kitchen to 'ask', and the child honestly had no clue what 'white meat' and 'dark meat' meant. The first answer he came back with was that the chicken came in a pre-portioned prepared bag, kind of Kentucky Fried Chicken style...which didn't answer my question, thus prompting the second trip. \n\nAfter the second trip back I heard the cook holler 'Tell him I'll fix him up'. \n\nWell, the chicken was prepackaged dreck like you'd find in the freezer case of Walmart, tiny and not good, and the potatoes had that slight tinge of chem-spuds flavor, laden with some kind of chopped up green (parsley?), and a side of that basic brown gravy served up in 5 gallon buckets.\n\nThank goodness for the basic salad bar.\n\nEven my friend admitted that her pork chops were different and not what she'd expected. They also appeared to be from a freezer bag.\n\nThe irony was that the boy who didn't know white meat from dark meat, was chatting with some other customers...about baseball...and he was a genius about the mindless sport of baseball. Ahhhh da burgh.\n\nThird base? Nah...why bother when there are so many other options around. Go on in a grab a beer and chat black and gold if you happen to be in Carnegie...they can help you out all types of ways in that area. Just don't go hungry if you actually have tastebuds.\n\nFrom what I understand it 'used to be' really good homecooked food. But apparently, mama has left the kitchen.", "type": "review", "business_id": "fNGIbpazjTRdXgwRY_NIXA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NwAlaSEjsWiiZlqnBOm1fA", "review_id": "52IK--CFb_PBGD_EPaMcFg", "stars": 5, "date": "2014-03-06", "text": "everything was great!", "type": "review", "business_id": "fNGIbpazjTRdXgwRY_NIXA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aOHQ9MlorpvL71Y6qC9v2A", "review_id": "f5WKGxGq-XTHJXPXhrC5Cg", "stars": 5, "date": "2014-03-21", "text": "If you are searching for a go to fish place for Lent....look no further.  This place will give you the best fish sandwich in Pittsburgh.  The sandwich has enough fish to make four sandwiches.  You will not be able to finish this sandwich in one seating.\nEnjoy....", "type": "review", "business_id": "fNGIbpazjTRdXgwRY_NIXA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c67-0jrGj8tcW7M7TzqsqQ", "review_id": "H8Q56qgKvI8bfvhVuB6tdQ", "stars": 4, "date": "2014-07-24", "text": "Rocky's has been in business since the 1980s and still going strong.  Their food is good.  Not haute cuisine, pretentious!  Everyday, well prepared and taste bud pleasing home style cooking.  I've mostly gone during supper hours and  and ate in the dining room, but, today I introduced an old friend to \"linner\" in the bar.\nHe ordered the large version of fish sandwich.  Rocky's is famous for their fish.  Three large breaded and fried fish filets, bun and fries for under $10.  Needless to say, he had no complaints and brought home more than he ate.\nI ordered the meatball grill.  It was delish.  Served on thick cut Italian bread and made \"grilled cheese\" (mozzarella) style.  Meatballs and tomato sauce are both good!  Also, served with fries.  I brought home half the sandwich.\nAnother good meal there.  Friends, mother, and former boss all enjoy their food!", "type": "review", "business_id": "fNGIbpazjTRdXgwRY_NIXA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L_aMQmKqw5TTcWRYGI2CAQ", "review_id": "1C0eSe0umaGzYqck8Uh0WQ", "stars": 5, "date": "2015-01-06", "text": "Italian dinners, American, endless soup and salad bar is great. Most food for your dollar. I highly recommend. Great bar. Good place to watch a game. The bar can get quite noisy in the evenings, but it adds to the great atmosphere at Rocky's", "type": "review", "business_id": "fNGIbpazjTRdXgwRY_NIXA"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "PrMlXX6fbMsJie9ausN41g", "review_id": "Phd_OwFhKQptiVL5Tbl-Lw", "stars": 3, "date": "2007-03-31", "text": "If you want a true understanding of Pittsburgh in the morning, come here. This greasy spoon is always packed, and is one of the better of its kind south of the city.\n\nThey serve waffles in halves, which is great. The eggs and toast are good, the homemade hot sausage is excellent. The drawback are the barely cooked potatoes.\n\nIf you're hungry, get \"The Mixed Grill\"... Gab and Eat's brand of the \"kitchen sink\" breakfast that all Midwest places are about.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FNbm3ycU2BF8C17UFfWzOg", "review_id": "uSoZMwdnhiegEpbXCwWATw", "stars": 4, "date": "2007-08-02", "text": "Good Luck getting a seat, that's all I have to say. The Gab and Eat is famous and infamous. Diner food is what's up and I like it. When I was a roofing mechanic, we'd meet there before work. Although I'm not sure I would recommend it if you're working were there's no bathrooms. hehe", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EtSjuNdguCE9AcmCOVYqxw", "review_id": "O7qgsnbzKdswwncjdJiyPw", "stars": 5, "date": "2008-04-12", "text": "Stick to basics and this is the best place in or around the 'burgh.  First time go with a friend and sit at the counter.  Short order cooking at it's best, it's like a floor show with the actor's backs to you.  Breakfast has no losers.  Eggs, omelets, pancakes, waffles, breakfast sandwiches to order, the ever popular mixed grill, get a 1/2 Louie instead of home fries (although they good as is) and don't forget the italian toast.\n\nFrequently voted the best burger in Pittsburgh for a reason.  As for ambiance, well lets just say I don't think there are two matching plates or coffee mugs in the joint.  But the coffee's good and hot and refreshed often as the service is good, andlocal with many long time folks working here.  If I don't get there for awhile I need to go through detox because I feel too healthy.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dxJK0ZLxRsQY16-wwKjzIQ", "review_id": "hvWEpeM6B8-DfS5vpz5FDQ", "stars": 5, "date": "2009-03-10", "text": "Cheap, unpretentious, and, for this, one of my favorite breakfast joints in the country.  Simply put I LOVE it here.  The mixed grill, the sausage and egg on a biscuit, the home fries.  This it the very definition of diner.  Thank you Gab 'n' Eat!", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gl46Pxc4OzLai8JVyxUIwA", "review_id": "b2REC3pxNuFWLFVhY0uUjw", "stars": 5, "date": "2009-04-07", "text": "Okay, let's first set expectations.  This place is a true DIVE...this is not for the NYC foodie crowd.  If you want a down home, large portion awesome breakfast, this is the place.  The place is packed with happy diners, the server was very friendly in a busy grandma kind of way.  The best part - they have \"dippy\" eggs on the menu and define the degree of dippy you can order.  For anyone who has never heard of a \"dippy\" egg - this means sunny side up or over medium where the eggs are still runny and you can dip your bread in them.  The eggs were great - I ordered mine over medium, the breakfast potatoes were fab - no complicated additives like peppers or onions - just plain good potatoes cooked in fat - the best part - the fresh Italian bread.  YUM!!!", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tgKy3r3vI7xMO8ZPh86M3Q", "review_id": "QUTm6jM1Hrn2Uu1c7Q2WrQ", "stars": 4, "date": "2009-08-20", "text": "I miss this place. When I return home to pittsburgh this is always a must to ease myself into a saturday morning recovery after getting banged up on cheap south side cocktails the night before. When I think of pittsburgh, I remember cutting morning classes in highschool just to get after the best bacon egg and cheese i know of. Honestly i live in nyc where you can get a bacon egg and cheese on every single corner, and nowhere that i have been does it as well as this joint. Go here and you will be happy you did.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Yv0JrZLmUWBmsWwaxuRQtg", "review_id": "ifRZpPzLrInrEmZ4dGEFjA", "stars": 5, "date": "2010-03-07", "text": "I've lived in Pittsburgh for 6 years, and in Carnegie for over 2 years, and by far, this is the best greasy spoon joint I've found. If you can stomach the wait (no reservations, naturally), you'll enjoy overflowing plates of goodness, thanks to the well-seasoned griddle where all of the food is made. \n\nHere are the highlights:\n\n-Cheap: Breakfast for two can be well under $10, with lunch around the same.\n-Crowded: Get there early and expect to wait. They close pretty early on the weekends too (oddly, at 12:45pm)\n-Cash only\n-Huge portions: When ordering fries or homefries, always get the half order, unless you're a lumberjack\n-About those homefries: They're often undercooked. I've had better, believe me. My favorite things to eat in life are potato products.\n-My favorite item: hot sausage sandwich on thick Italian toast, with cheese, lettuce, tomato and mayo", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ob2NmltzrzoNBRDfJqitlg", "review_id": "XQfruJc2C_HOYkEMEOdGhg", "stars": 4, "date": "2011-02-06", "text": "Definitely a greasy spoon! Always packed here and always a wait but worth it. The omelets are really tastey especially with their homemade sausage. I also like the mixed grill.  My parents love their burgers. Took off a star for lumpy booths and really tight tables (your arm gets hit when someone walks past) oh and waitresses aren't very attentive.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bcwr1bFov3PSa1FiGfpc9g", "review_id": "0U1BqZz8XETsdzbVLTv2_g", "stars": 4, "date": "2011-07-05", "text": "Great homemade hot breakfast sausage and a wonderful family restaurant feel. \n\nReminds me of the one my parents used to own in Mi. \n\nHave fun finding a table on the weekend :)", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "AY-W59xCVPDaCaOKJOQUhw", "review_id": "cmliNQk3fUcfzmxSBt60XQ", "stars": 5, "date": "2011-11-15", "text": "Great breakfast place. Come hungry. Look for Dick, my dad, and Gino at the counter every a.m. about 0830 and say hi. Try the mixed grill (half).", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "QQocldIYWMrQff9MSTEKyQ", "stars": 3, "date": "2011-12-05", "text": "OK, what is with all of these \"CASH ONLY\" places in Pittsburgh? I can appreciate that some smaller businesses might have trouble installing a credit card system in their store/resturant, but could you perhaps provide an ATM?  In the past, this would deter me from eating at this place. \n\nLooking at a standard breakfast menu, I decided to go with a tuna melt instead. What I got was a cold tuna salad sandwich with a slice of cheese on toast. I had ordered a melt being in the mood for a warm meal, but to no avail. One day later I can't even remember what my side was. I suppose it didn't leave much of an impression on me.  I have to say that the dessert was really good! The cherry pecan pie! I have not seen this concoction anywhere else but this was awesome! The cherries were not the sweet canned variety, but a pie worthy tart topped with sugar. I think I want to make this pie with my parents next harvest of our cherry tree!\n\nMy first impression is \"Eh.\"  I am learning how crazy Pittsburghers are over breakfast! Seriously, waiting 30 minutes for a table at a tiny diner with a menu that reads as follows:  \n\n\"2 eggs and toast $x.xx\"\n\"2 eggs, meat, and toast $x.xx\"\n\"2 eggs and pancake $x.xx\"\n\nI'd rather go to a Denny's and order the \"create your own Grand Slam!\"", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gcjQt9J7TdnMhZGwDHuXcA", "review_id": "hJ-DBQbzez8rjzbTdQvxtw", "stars": 5, "date": "2012-02-12", "text": "BEST DINER IN THE COUNRTY!!! We've been to many famous diners across the country and we still give  Gab and Eat the best rating !! I was a little intimidated when I first walked in and there was like 2 pounds of butter just sitting on top of the homefires on the grill.  If you are looking for a healthy breakfast they probably can accomodate you, but Everything I ate was clearly the opposite of healthy.  After trying like every meal they have I would recommend the mix grill(half unless you are sharing) adding cajun seasoning with the texas toast.  Burgers are great too.\n\nIt's hard to find a place that makes a better breakfast than you could make by yourself at home, but this place does it.  The atmosphere is classy, old school Americana.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "irPsx5KWCwVX44AlSltXXA", "review_id": "k7uUTQEajb0lQejn58dtWg", "stars": 5, "date": "2012-02-19", "text": "Best French toast ever!! Love the friendly atmosphere, and especially the breakfast. Never been disappointed. You have to try French toast with raisin bread too... yummy!", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "1giup8Tfm44sYcFoN3PmwQ", "review_id": "uujhOop1gT59m6XQG-h-EQ", "stars": 5, "date": "2012-04-05", "text": "Great Diner!  Their breakfast is the best in the area!  Lots of  choices and always good.  Love the unique mugs they use for coffee and all the writing on the wall.  Get there early otherwise you will not get a seat!  They have homemade hot/sweet sausage and texas toast.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "9Ify25DK87s5_u2EhK0_Rg", "review_id": "W1VCaPd82BkBELrFbk97nw", "stars": 5, "date": "2012-04-07", "text": "Readers of my reviews may recall that I once referred to The Dor-Stop as possibly the best breakfast in Pittsburgh.  Well, faithful followers, I must now admit that The Dor-Stop has now been verified as only one of the best.  Why?  That's because Gab and Eat I have now found to be THE best breakfast I've ever had.  If it was closer to my home I would quickly become a regular.\n\nI easily decided to order the Mixed Grill (Half).  Before I go on, I must ask...has anyone seen a full order?  Because I honestly can't imagine how much food that is.  I created my own with bacon, cheese, eggs and potatoes.  Based on reviews I also opted to get a side of the sausage and was pleased as punch when our waitress asked if I wanted hot or sweet....or one of each.  I like variety, so I jumped on the change to try both.  I also selected the Italian toast - what other kind is there, really?  \n\nWhen my food arrived, it looked delicious.  There was so much bacon that after eating half of my Mixed Grill it looked like I'd barely started.  The sausage was great, just don't ask me which one I liked best.  My toast?  4 thick slices that looked to be about half the loaf and were buttered on both sides. It was a struggle, but I was determined to enjoy every tasty morsel and not leave a crumb.   \n\nIn case anyone is wondering, yes, they use real butter.  I saw pounds of it stacked in the kitchen with my own two eyes.  The wait staff was quick and efficient as well as helpful and friendly with our larger group of 9 people.  The fact that none of the plates match and I noticed a sign at the front register that said, \"We need mugs\" just makes me love this place even more.\n\nA few tips: 1.) Order the Mixed Grill.  2.) Cash only!  3.) Gab and Eat is a popular place but also very small and narrow (or cozy if you will).  I recommend going during the week when they are still busy but can accomodate a group.  That way you won't feel rushed or crowded.  4.) Get to Gab and Eat ASAP!  You'll be glad you did!", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "GwcBPWbgjegIxXViOdSuVg", "review_id": "KzI8WstuSYFrX_-YO46gXQ", "stars": 5, "date": "2012-06-25", "text": "Classic breakfast joint.  Grimy looking hole in the wall located on one end of a seedy looking strip mall.  Window is opaque due to the grease so you can't hardly see inside. On the outside, there are about a dozen people waiting to get in.  When you finally do get inside, you see that there are 15 tables and a counter, all occupied by people from all walks of life.\n\nWhat's the attraction behind this flea hole?  The FOOD!  Lots of it and dirt cheap.  I sat at a vacant stool behind the formica counter and ordered the mixed grill.  Potatoes, eggs, sausage, bacon and Italian toast.  A giant mound of food guaranteed to sooth any hangover.  I swear the full mixed grill had two pounds of food.  Neat thing is that the grill is right in front of you so you can see your potatoes and eggs frying in a pool of fresh grease.  All that food, plus coffee and tip for around ten bucks.  Cash only, so put that plastic away.\n\nOnly bad thing that could happen is some douche bag from the Food Network or Travel Channel will make this place famous, and then I'll never be able to get in.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 8, "useful": 5, "cool": 4}, "user_id": "Nhvkukz5MECqEUQVfh6A6w", "review_id": "BCGT6fIYSztyQK5xTYZX3g", "stars": 4, "date": "2012-07-15", "text": "Yum - freaking - me!\n\nAs the other fellower yelpers mentioned - this place is a cash only.    A couple of recommendations:\n\n- Don't eat early in the week \n- I don't recommend wearing any tight clothing (no skinny jeans) - you will not be skinny when you leave\n\n\n I walked in for breakfast one early weekday AM.   The place was packed with locals and regulars.    A very good sign.\n\nMy co-worker recommended I get the mixed grill.   I ordered the large mix grill.   My waitress tried to warn me - it is large (very large).    I ended up eating the left-overs for the next 2 days.\n\nFood - \n\nThe Mixed Grill comprises their homemade sausage, grilled onions, grilled peppers, potatoes, fried eggs.     \n\nPortion -\n\nThis should have been a man vs food episode.   I was not going to attempt to eat all the food.   It was really good.\n\nService - \n\nMy waitress looks as if she had been working there for years.   She was fast, friendly, and offered good advice.\n\nPrice - \n\nThe cost ranges $5 - 10.\n\n\nI will definitely go back after I buy some new stretchy pants.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fFXsUH9uLapH_BopOIBKHA", "review_id": "P6lgwMDMRfd7qSpt-MHFew", "stars": 5, "date": "2012-07-29", "text": "Best breakfast spot in the area, If you like diner food it is the place to go. Small, so you will want to avoid the church crowd on Sundays, but the wait is never too long.  Everyone is friendly and has obviously been working there for a while.  If you are feeling like lunch food go a little later, their burgers are made on the breakfast griddle and are delicious.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1VMTfE5MlQyDIRGWDSNsvA", "review_id": "yNGI6O_AoV0dW0_MiF7RNA", "stars": 4, "date": "2013-02-21", "text": "Great breakfast, good price. You might have to stand outside in line though, so I don't really recommend winter time to go. lol. Very friendly service, interesting coffee mugs. They have great deserts and such also. Bring your cash though as they dont' take cards.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "rGuk1S7MIU8M9ZE2mulVsg", "review_id": "DaQYAkRoGu-kOYGfHqd9Wg", "stars": 5, "date": "2013-03-16", "text": "I always love a good diner.  Gab and Eat was just what we were looking for on a Saturday morning.  Good food.  Great people. Pittsburgh ambiance. \n\nThis place is obviously a beloved neighborhood gem.  I had french toast and bacon.  The french toast was made with the best Italian bread.  My fiance had what they called a 'mixed grill.\"  It consisted of eggs, peppers, onions and home made sausage.  Not something you would eat everyday, but he loved it!   They also had great coffee.  They actually ground up the beans in front of us.  Now that's fresh.\n\nWe want to return sometime for \"turkey day.\"  Apparently they made fresh turkey every Tuesday.  Now that sounds good!\n\nCan't wait to return.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "ElHMvz-1_xfOl_noq_2Utg", "review_id": "Tmhhfpe6zIBzQZ9_1Z5big", "stars": 5, "date": "2013-04-08", "text": "This is exactly what a breakfast place should be like--comfortable, quirky, unpretentious and with inexpensive, large portioned working class breakfast plates.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GYSqprhDteK52ILOBaFCIQ", "review_id": "S-Y34-9ujttt9UOm6QjD7A", "stars": 5, "date": "2013-04-13", "text": "On our current road trip of baseball, brews, hockey and diners, we decided to try Gab & Eat based on yelpers rating putting it #1 for breakfast in Pittsburgh area. We have to agree with most other reviewers that this is a place to eat.\nWe arrived around noon on Saturday and were happy there were a couple open tables. The place is tucked at the end of a strip mall and you have to look to find it. There is plenty of parking.\nInside the decor is quaint and funky at the same time. Country style decorations and signs are mixed with nostalgia signs & posters. Most interesting are all the signatures and comments written on the wall by past customers. We regretted not having a marker to add ours. The other highlight was three large white boards with trivia questions - fun way to spend time waiting for food.\nThe waitstaff there is...uh, experienced. They are attentive, pleasant and efficient.\nAfter reading reviews I had to try the Mixed Grill. But S went with pancakes with a side of bacon. The pancakes were outstanding...maybe the best either of us has eaten. They were thick but with light texture and rich flavor. \nHis bacon was cooked just as requested - as crisp as possible - and very flavorful.\nThe Mixed Grill is a mixed together concoction of eggs, potatoes, onions, peppers, cheese, and spicy Italian sausage grilled together. I'm glad I heeded those who stressed going with the half size order. It filled a full sized dinner plate with a heaping order. I couldn't finish it all and that's rare. How do they serve the whole potion -- in a trough?\nEverything was cooked well. The sausage added a nice bite to offset the somewhat plain potatoes. You can build your own mix but the basic was a good mix.\nMy only complaint was the amount of potato and that they are pretty plain. I like home fries with lots of seasoning that have aged on the grill. These potatoes were pretty uniform chunks with little seasoning. Personal preference.\nIt usually comes with Italian toast but they were out so I went with raisin. It was delicious soft inch thick slices.\nCoffee was excellent and the cup stayed full. The total was less than $15. Fabulous value for the quality and portions.\nWhile I can't say it's the best breakfast in Pittsburgh (only here 3 days), its the best so far and one of the best we've had.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Dg9xy4ZbsteCBUL_sjaNKA", "review_id": "LTHhgovWBAXquOrDVKx3Yw", "stars": 4, "date": "2013-09-25", "text": "Met my nephew for lunch in Carnegie and he suggested Gab & Eat.   Way to go Justin!  The restaurant is in a strip mall across from the Dairy Queen.  The grill is right up front so you can see them cooking.   They have counter space for eating and tables/booths for 4.   Don't expect to sit at one table if you have more than 4. They have a great looking breakfast menu.   We all got burgers of varying kinds!  They were tasty!   The buns were buttered, toasted and soft.  Yum!   the amount of butter didnt bother me  but it did my whiny mother. Who whined even though there is a no whining sign as you walk in the door.   We ordered fresh cut fries as onion rings.  Both of which were great.  The half order was plenty and a nice option to a full order.   The restaurant was full of local men at lunch which is usually a good sign.  I give it a 4 star only because of the waitress who kind of threw straws, silverware and napkins at us as she walked behind the counter.  At least she didn't throw the food when it came!   She also served the fries and Onion rings way before our burgers came out which was kind of weird.   They were nice and hot but would have been cold had we waited for the burgers.   It didn't factor into my four star rating but I deduct a star from nephew because he invited us out to lunch then allowed me pay!   Just kidding Justin!   Love ya!", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "PShxCNSE1_YmNDJOFzyTRA", "review_id": "2j88bZAxruuJvTZVoykuFw", "stars": 5, "date": "2013-10-06", "text": "This is a perfect example of what a breakfast diner can be: excellent breakfasts in huge portions for cheap. I had the western omlet and will be getting it or another omlet again soon\n\nThe coffee was good, totally serviceable diner coffee. The waitress was wonderfully friendly and hopping around from table to table. The food was excellent. The ambience was exactly right for a diner. It was packed. The wait was not nearly as long as I was expecting. 10 minutes maybe.\n\nTotally recommended. Come hungry.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HzB5eZLSabmOUDc3ItgIcQ", "review_id": "QjJCkJBBLa3Ahiw4vL3B9w", "stars": 5, "date": "2013-10-12", "text": "Wow! Read the great reviews and I was not let down. Huge portions. The mixed grill was THE best breakfast I've ever had. If you go to Pittsburgh it is a must eat. Service was superb. Friendly staff. Led zeppelin on the walls. .....what else could you ask for?", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "f6sXlAT1R6F5NMIAeUHpXQ", "review_id": "ooKc6TRmLI6mVD0HTGSM3Q", "stars": 5, "date": "2013-10-31", "text": "I have been coming to Gab n Eat for almost 20 years and They have never let me down. I get a typical breakfast if eggs, ham, toast, and home fries. Delicious as usual. The ambience however is usually lacking. The walls are dark, with writing and signatures of semi famous people all over the place. Pictures of local people hang on the walls(i secretly want mine up there) along with posters galore. While its fun to look at the first 10 times, it gets a little boring after awhile. So today when I arrived I expected the same old experience. Wow was I wrong! As soon as I looked at the door I knew something was different. The place seemed lighter and brighter. To my pleasant surprise, they painted and got new counter tops!! They're not quite done yet but the place has a new Happy vibe to it. The awesome breakfast, the new decor and the 5 guys sitting at the counter making me laugh are why I will be back( maybe for lunch).", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JAe6HSt7J4OtkcFWYJNURA", "review_id": "IJ9-IjWSGLNbIk6GBYzn-w", "stars": 5, "date": "2014-05-04", "text": "A gem. The coffee cups are mismatched . The owner is three feet away from me cooking. The sausage is made for them locally. And the food is frickin awesome. I had the pancakes, my daughter had the sausage and egg sandwich.  Cash only.  Friendly service.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CiCmxCruMvbXtjQP5FhbLg", "review_id": "g8jO02F66MyA3MMq53d6fQ", "stars": 5, "date": "2014-09-05", "text": "Excellent breakfast and lunch menu. Friendly staff and super food. Modest environment with excellent food. Worth the wait.. dont miss this one. \nBest breakfast and lunch food in the Pgh South Hills hands down.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1Hx--oyAcojSfqQYERNkig", "review_id": "MTZKEsU_0zZe5XEBoNZHOA", "stars": 5, "date": "2014-09-30", "text": "What a find! I stopped in here for breakfast while in town for business. The service is so friendly I thought I was down south. The service was quick, frankly and felt like I was with family. \nFantastic poached eggs, Cajun homefries and crispy bacon. Gab and Eat is definitely a place I world recommend to locals. I was stuffed and the bill was only $8.00.", "type": "review", "business_id": "b9WZJp5L1RZr4F1nxclOoQ"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "E8K5lVfbsg-x9KX9gOIfzA", "review_id": "ceqgl_4w27yRGv9yijLj9g", "stars": 5, "date": "2011-12-01", "text": "Barb's Country Junction gets a 5 star rating for me because it is truly everything that a Pittsburgh restaurant should be.  In addition to being the apple of my nostalgia's eye, it is also the constant thought of my tummy when I'm hungry on the weekends.  \n\nBarb's breakfasts cannot be beat, but truly any meal you get there you won't regret.  Everything is made to order, with fair portions, and great prices. My recommendation is a breakfast sandwich on a bagel and a coffee.  There's nothing better than drinking from a cup that could have come from your grandma's kitchen.\n\nI know that Gab N Eat is nearby, and Barb's can be a little weird get to with the strange traffic pattern but this really is a gem of Carnegie that you've gotta try!", "type": "review", "business_id": "zaXDakTd3RXyOa7sMrUE1g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FyQ9wsYI-17OTSZTnXmNbg", "review_id": "4kAOfPDybemCHIcaWpKqKA", "stars": 5, "date": "2012-10-14", "text": "Great little place. Treats you like a local.Eaten here 3 times a week for a month.  Same overtime. Barb is always here.", "type": "review", "business_id": "zaXDakTd3RXyOa7sMrUE1g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x2kLEDf4JfnIdIDToLQ9fQ", "review_id": "fkkVew1rKmrljkng92lGtg", "stars": 2, "date": "2014-07-19", "text": "My first time going to Barb's Country Junction and I really wanted to like this place, I really did...however, I didn't.\n\nThe food was decent, some was above average and some below but it was overall decent. I got pancakes, bacon and eggs. The pancakes were really good and fluffy, the home fries were simply okay and the eggs were not cooked well. My son had a burger and it was good. The coffee at this place was brewed to perfection which a appreciate. I would give the food 3/5.\n\nThe service was subpar for sure. While our waitress was a really nice girl, she wasn't on top of anything at all. Had to ask for coffee refills, had to ask for silverware, for napkins...etc. She got the order messed up and so on. I give the service 2/5.\n\nThe inside of the place had some country charm as you'd expect but want particularly cleanly. It also had a leaky roof in several places which had buckets collecting the water. A customer even tripped over the buckets and fell. I give the interior 2/5.\n\nThe prices were decent. I fed my whole family breakfast (3 of us) for $23. I give the prices 3/5.\n\nSo in summary, you can get okay food here for a rather cheap price but it is not a great place to dine in by any means. There are better diners in the area that I will patronize in the future rather than Barb's.", "type": "review", "business_id": "zaXDakTd3RXyOa7sMrUE1g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S5oBX7uhY4wYyDjvka4cWg", "review_id": "6Ftual_LjWaLHOJ4nvLhiw", "stars": 3, "date": "2014-11-08", "text": "My husband and I tried this place for the first time today. It was easy to find and no problems with parking. It's \"Seat Yourself\", but there were no signs stating this, so we stood there looking like fools for a minute. It took awhile for the waitress to acknowledge us and I'm guessing that this was Barb. She apologized and said that one of her workers called off today. No big deal and her apology was appreciated. She came back with our drinks, dropped them off, and left again. We didn't see her for another 20 minutes. Ultimately, we were there for 30 minutes before she took our order. This was aggravating to me. I don't mind waiting for my food if I know it's going to be awesome and they're making it with love, but come on now. We ordered the hot pepper omelette/home fries/ toast and chocolate chip pancakes/sausage. The food was alright, really nothing special. A new waitress ended up taking care of us and she was much more attentive. We may or may not go back.", "type": "review", "business_id": "zaXDakTd3RXyOa7sMrUE1g"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "jykemU4-CaDr-8Lnei-_ZA", "review_id": "QT3MCOoLoT7VUZ38Dd5wMA", "stars": 3, "date": "2011-01-20", "text": "For the price I ended up paying, this place was fine. There was a full kitchen, king bed and TV. I was just surprised at the lack of amenities at the hotel. While I have stayed at other extended stay hotels, I was surprised to find a sign in the room at this one stating that you only got your room cleaned once per week...if you wanted it more often than that you would have to pay for it. If you needed fresh towels, you'd have to go to the main desk to get them. They also only provided a small bar of soap in the room...not the typical soap, shampoo, lotion, etc. This didn't bother me too much as I was only staying a couple days but again I found it surprising not to have these basic things. \n\nThe hotel in general was easy to get to and very easy to get back onto to freeway from. The hotel was clean and the people who worked there were very nice.", "type": "review", "business_id": "zgy27FSnvwdINfk5cXBIyQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "x4Lr_NkzNvEeMjf_qlUD1A", "review_id": "aLHdCGrJoNXPhdoVyextng", "stars": 4, "date": "2012-03-06", "text": "Great value, close drive to city, not much to do around hotel, its a business park. Carnegie city has a few bars and restaurants.", "type": "review", "business_id": "zgy27FSnvwdINfk5cXBIyQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "22OgTmm9O84x7v1js4anuw", "review_id": "IOaY8bY38o9wMMuIvqn6rA", "stars": 4, "date": "2014-01-05", "text": "Simple\nRustic\nLocal\nWait that is every Gordon Ramsey review\n\nMy experience at extended Stay America was great. The staff was warm and friendly and made it a point to speak to me every morning as I left and when I returned in the evening. They went out of their way to provide A confirmation and point me in the direction of restaurants and nightspots when needed. \n\nIf I ever need to utilize an extended stay hotel I wouldn't hesitate to head back there.", "type": "review", "business_id": "zgy27FSnvwdINfk5cXBIyQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fEj7Gb3yXriiiAax9ay8Fg", "review_id": "tchG2uDQ_ZXcFSGF70Xe_g", "stars": 5, "date": "2014-07-27", "text": "Tonya is super sweet and the front desk people are very helpful", "type": "review", "business_id": "zgy27FSnvwdINfk5cXBIyQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "LwEfyIPU8woMqZsKqrf7NA", "review_id": "RlmEDnnBzh1EsFCQWqmEAw", "stars": 4, "date": "2011-03-14", "text": "Be warned. Don't expect the best service ever. It's not the cleanest place you've been in either. The decor is soccer jerseys from places and teams you've probably never heard of. It's divey, eclectic, and authentic. \n\nIf you're looking for good Irish food and a cold pint, you can't go wrong at the Pour House. Like most of Carnegie's Main St, this is a hidden gem worth seeking out. They have some of the best Irish food I've had in Pittsburgh- the colcannon is awesome and the shepherd's pie is out of this world. If you're not looking for Irish food, then try the grilled cheese- and make sure you ask it with the three cheeses together. It's big and the cheese is thick and gooey. I get it with a side of potato pancakes... Yum. \n\nAlso, they have Guinness, Smithwicks and Harp on tap...", "type": "review", "business_id": "WETE_LykpcnrC1sFcQ5EGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "heoc96QXrTbecWVw933qhQ", "review_id": "H6sZ-kD7ungCECsGpORobw", "stars": 4, "date": "2011-08-20", "text": "Best Irish food in the Burgh.  Great bar food too.  The service is maybe a bit surly and it's not the cleanest, nor the best decor.  But, that's not what this place is about.  It's a town Irish bar and it serves great solid Irish fare and suds to the locals.  And it does it better than anyone.  I go back again and again.", "type": "review", "business_id": "WETE_LykpcnrC1sFcQ5EGg"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "neBCZl1X_pDl11y7nVYFoQ", "review_id": "AfOVld6Rc2Uky5FINRs0nA", "stars": 2, "date": "2012-05-07", "text": "Okay, so hopefully you haven't been enjoying happy hour @ Riley's Pour House before you read this or you might not be able to follow the lilting Irish owners. \n\nTo recap: Murphy's Pour House from 1979-1985. Sullivan's Pour House from 1995-2002. Paddy's Pour House from 2002-2012. And, bagpipe please, Riley's Pour House opens March 1 of 2012. Still with me?\n\nIt's a tiny long bar just like the old Irish pubs. No more smoking allowed. Hurrah!!!  Same lousy service. \n\nMy guess is that the entire place needs (no, strike that .... demands) an automated food/beverage ticketing system. None of the cooks, bartenders, or waitresses know who ordered what nor what ticket belongs to which table. It's actually pretty funny if you're not a) hungry or b) thirsty. \n\nI really really want this place to do better. We need more Irish pubs and local old time watering holes. \n\nGet it together, Murphy's ... er, I mean Sullivan's....er, I mean Paddy's or is it Riley's? ;  ).  Whatever the case, they have cold Guinness. And Irish music.  And fun patrons.", "type": "review", "business_id": "WETE_LykpcnrC1sFcQ5EGg"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "jc6LD2wn5YrW3BUcxuX50w", "review_id": "cZtX3Ir_KQ8FHIhDrFzPAg", "stars": 1, "date": "2011-09-01", "text": "The delivery driver mistakenly rang my doorbell, having confused 133 and 113.\n\nRather than taking a step back and analyzing the situation, he begins to accuse my wife and I of ordering and refusing to pay for this pizza.\n\nThe driver then gets on his cell phone and rather than calling the number than was given when the order was placed, begins to call his bosses and starts threatening me with felony charges. \n\nSo I take the initiative and ask the fine upstanding gentleman what the phone number of the order-er was, phone my neighbor and discover the mistake. Rather than a thank you or a sorry, he just speeds off (breaking the speed limit on our block) to reach his destination 50 feet away.\n\nI would call to complain, but based on the other reviews, its clear the owners do not care about Carnegie or it's residents, and its pretty well known around town just how awful their food is, so it would be pointless to boycott a place I'd never order from again anyway.\n\nDo yourself a favor and order from ANY other establishment in town.", "type": "review", "business_id": "6o3RK6rTcN3nw-j-r2nQmA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PRTVZdLWYmhozxkplGA9qQ", "review_id": "JR8An8RS-0zOk7g1qGpJGg", "stars": 3, "date": "2012-04-01", "text": "3/6/12  visit -  i am from san francisco bay area and if u want a dive go to china town in san francisco. - this place was dirty like chinatown dive but some of the best food i have every tasted came from a dive. the food was really good and my group ordered a bunch of different things it was all good- a- taste.- prices are reasonable a-. --------they dont speak english very good and got my order wrong.\nsweet potatoe fries a+\npizza  - a\neggplant hoagie b+\ngreek salad b+\ngyro a+\nif they scrubbed the place down and the lady spoke better english 4 star ****", "type": "review", "business_id": "6o3RK6rTcN3nw-j-r2nQmA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V1oOVqCOc3RRSUvcrEQgVA", "review_id": "9s0_JxiIK4bjXvwUsjKPLQ", "stars": 4, "date": "2012-08-26", "text": "Recommended. 16 inch pizza on special was cheap. Fast service. Not the best pizza but above average.", "type": "review", "business_id": "6o3RK6rTcN3nw-j-r2nQmA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fTg6Rz2Rs1LLYN_U7TJbcQ", "review_id": "TCe8wx6uA54ouA9IWbaG2g", "stars": 1, "date": "2013-06-10", "text": "Some of the worst pizza I've ever had.  We used a coupon from the paper for a 2 topping 8 cut Sicilian. First of all the pizza wasn't even cut through, and the sad attempt at cutting was so uneven that 4 of the slices were about an inch wide, while the others were about 4\" each. The toppings were scarce, they used mini pepperoni and put maybe 8 on the whole pizza. The onions were huge chunks and the mushrooms were straight from a can. The worst part though was the thick doughy crust that tasted more like a fishy sourdough roll. I'm serious... It was so noticeable that it made me wonder if the dough was bad or if they for some weird reason put fish sauce in it. It was gross. \n\nWe also ordered steak and Italian hoagies. The veggies were old and wilted, and there was no dressing on either. The Italian had deli meat that was clearly bottom of the line and not very generous. The \"steak\" (if you an call it that) was greyish instead of brown and looked like it was a processed meat chopped into pieces. No flavor or seasoning and the texture was reminiscent of spam. It was so bad that I only ate 1/4 of it and tossed the rest. \n\nI have ordered from here in the past and always been disappointed. I thought I would give them another try since I'd never ordered a Sicilian pizza from there. What a mistake. I will never order from them again!", "type": "review", "business_id": "6o3RK6rTcN3nw-j-r2nQmA"}
{"votes": {"funny": 0, "useful": 6, "cool": 1}, "user_id": "dEfFa1y8HOvwjd3Tztzs0g", "review_id": "-578MwX47DW2lNlu3MQMFw", "stars": 4, "date": "2013-08-09", "text": "Having certain businesses with skill sets in your local neighborhood is important.  I try to keep it as local as possible, so when I heard about a tailor in Carnegie I was intrigued.  The building is in a strip mall across from Carnegie Coffee Company.  Unassuming, looks like it is closed all the time, until you do a drive by and see the hours posted.  There is a Latino man in his 20's working when you arrive.  In my mind, I imagine a tailor to be older, kind of like my grandfather maybe with measuring tape around his neck (Textbook movie tailor), so I was a bit trepidatious about dropping off my clothing.  He asks you to go change into a closet (Yes, a closet to change in with one lightbulb) BUT all my worries aside, the moment he started working on my items I knew he was the real deal. He learned from his father at the age of 14 how to sew. and he does things the correct way.  Meaning, for example-  I took in a pair of khakis all the way down to the cuff, but he seamed them up to look EXACTLY the way they were when I first bought them.  Most placed will have bulges and puckers.  The rest of my items were just as perfect.  Very inexpensive at $10 for a pair of pants to adjust the hem.  The items were done in a timely manner.  He takes his business very seriously.  While I was there, I watched a lady rush in and demand 6 shirts to be altered in an hour, and he did it and charged the same price.  Really nice guy, please go and support this business to keep him around town!", "type": "review", "business_id": "woOVJ0Z2f6XNCDntHA3b_g"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "h4aLzC0_xoYSbm23ciekyQ", "review_id": "Gu3Mxmy6WRlnCs9MGo2uvw", "stars": 5, "date": "2013-09-21", "text": "New to area and decided to pay this shop a visit! It was definitely the best experience I've ever had with a tailor. He is MUCH cheaper than the other shops, he charges 10 while others charge $15, and he goes above and beyond for what he charges.\n\nI dropped off 4 jeans, and he hemmed and tapered the jeans! I couldn't even tell the difference between the store bought jeans and the quality of his work. It was absolutely perfect, no bulges or puckers! They the match the exact stitch as the factory. \n\nAbsolutely a great guy, they were all done and waiting for me as promised! I'll definitely be taking all of my business to this place, and would highly recommend to anyone who is looking for a personal tailor who actually cares about his work and building an honest business.", "type": "review", "business_id": "woOVJ0Z2f6XNCDntHA3b_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HEsdDAq-790wg9BEmnDnfw", "review_id": "OGwtuZgVxsLSKHeXMNYbkw", "stars": 5, "date": "2014-08-31", "text": "I needed alterations done to my suit very quickly. Like three days quickly. Not only did Filberto at Alteration World have it ready, the price was beyond reasonable and the work was EXCELLENT! I plan on bringing all my clothes to him from now on.\n\nOh and he let me know that they also dry-clean. Wonderful shop!", "type": "review", "business_id": "woOVJ0Z2f6XNCDntHA3b_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sdy0RPXf0nxZ-15Zb_Fxmg", "review_id": "OCLeQpUqMHIWBUlESVg15A", "stars": 5, "date": "2014-09-17", "text": "This is the best alteration place I have been to. The guy that owns it is extremely helpful and works FAST. Also, the prices are so reasonable I wonder how he stays in business. He was able to do an alteration on short notice and was very acommodating. The alteration I needed done--and fast--was right in the middle of prom season. All the other places I called gave me a several week wait, but he took me right away. I will be back!", "type": "review", "business_id": "woOVJ0Z2f6XNCDntHA3b_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yqbv-xI54sz27HCTvRXcCg", "review_id": "tTSqWC6l6q6uK4_xvkddDQ", "stars": 5, "date": "2014-12-13", "text": "I just needed a broken zipper replaced on my favorite Penguins fleece jacket and a pair of suit pants hemmed.  The price was very reasonable and the work done was great.  I will go back for all my tailoring needs and highly recommend if you need any done.", "type": "review", "business_id": "woOVJ0Z2f6XNCDntHA3b_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MLQre1nvUtW-RqMTc4iC9A", "review_id": "sXmpmDWrJltamLu7glS4GA", "stars": 3, "date": "2013-10-14", "text": "Are you are really looking at the review for LJS?  Its fried stuff, with extra fried stuff in a cardboard boat.  You will regret eating it 30 minutes after you finish, but it is delicious.", "type": "review", "business_id": "rv7CY8G_XibTx82YhuqQRw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dnYS5JRUt7qdeSb9yh3dkw", "review_id": "QUt7RrsvsGj03kAjzBugaQ", "stars": 3, "date": "2013-11-02", "text": "I agree with Paul on this one. But I had to stop here on my way home from work tonight. \n(I think I feel my heart yelling at me again) , The gal at the drive thru window was just soooo sweet , I just might go back and ask her to marry me! \nBut then again , she gave me a slip with a survey on it to fill out online. \nMaybe she just wanted my positive response. Ok Sarah B. you got it ... now where's my free coke ?", "type": "review", "business_id": "rv7CY8G_XibTx82YhuqQRw"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "hZelXy7fk1fwICGvH6OMrQ", "review_id": "EZNiAEuUhfzk_Dw_jJfYHQ", "stars": 5, "date": "2014-04-22", "text": "It's deep fried garbage....it's LOS c'mon what do you expect.....however I have never had better, friendlier service at a fast food restaurant.", "type": "review", "business_id": "rv7CY8G_XibTx82YhuqQRw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "SeKrO18C8nqAZ9bWYOyxig", "review_id": "LvOtsQTVKS9oWm7jML4x8A", "stars": 1, "date": "2013-07-10", "text": "By far the worst most unprofessional dentist I have ever experienced her staff is too busy watching soap operas on all the TVs in each room instead of cleaning and she gave me a filling which was too deep which could have been understandable as her son had his pictures delivered from Hawaii and she had to stop 3 times to pay for them and show her whole staff all of them must be nice to have a 14 year old go to Hawaii on her moms dime and have her patience wait to see all of this happen I had to have oral surgery and have the tooth removed because she put the filling in too deep an abscessed tooth was the result I wouldn't recommend her to an ex girlfriend or someone I hate because of the three months of extreme tooth pain I had to deal with because of her lack of care and follow through even after I called and asked them for advice and follow up they simply could care less and did not even offer to reschedule an appointment other than prescribing me vicodin and antibiotics do not recommend and do not go to her license should be pulled!!", "type": "review", "business_id": "e_U_FnpdKVgNb4mUN2cU_Q"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "6VEID9yjoYWFZkUcP_GNBg", "review_id": "kfQftCM9V_VX5UmtNYP27A", "stars": 4, "date": "2013-10-04", "text": "When I moved to the area, Dr. Weinberg was recommended to me by my cousin who had been a client for years. I've had nothing but positive experiences with her and her staff since seeing her two years ago. The team is professional, nice and courteous. I recently had to reschedule an appointment due to a last minute work thing and they were very accommodating. My daughter looks forward to coming to the dentist so that's saying something. I DO wish they would turn off FOX news in the lobby as I'd rather watch paint dry but... nobody's perfect.", "type": "review", "business_id": "e_U_FnpdKVgNb4mUN2cU_Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Nhvkukz5MECqEUQVfh6A6w", "review_id": "BywchRHEvjmYSKorUhyHyA", "stars": 1, "date": "2014-05-13", "text": "In all fairness - I did not see this dentist but did schedule an appointment and waited 15 minutes for them to open.\n\nWhen I look at Yelp reviews, I usually weed out the outliers (the best and the worst).   Unfortunately, there are only two reviews.\n\nIt was my first time at the office.   The office admin (very nice) asked for me to come early (before 9am) to complete paperwork.   I arrived at 8:50.    I waited.   I watched 2 employees walk by me (unlocked the door and re-locked it).    They did not acknowledge me.\n\nThe door I was at had signage (open hours).    I decided to leave because of a review where the staff seemed distracted or disinterested in my presence.\n\nThe office admin (very nice) called me to inform I am missing my appointment.   I explained to her that there were too many indications where this was not going to be a good fit and wished her the best of luck.\n\nI recommend if you see this dentist you go to the front door (furthest away from the parking lot) for the entrance.\n\nPoor recommendation because the staff who walked by me seemed to be distracted which was pointed out in a previous review.", "type": "review", "business_id": "e_U_FnpdKVgNb4mUN2cU_Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jdfzz0EVCRXkpydEBNrtlw", "review_id": "HWbmfO2-YYthL2QMFIbuMg", "stars": 1, "date": "2014-11-19", "text": "I've been to this office a good amount of times.  Each time the receptionists give of a vibe of entitlement and it is very uncomfortable.  Dr. Weinberg herself is very nice, but I doubt her ability. Every procedure she has done to my teeth has backfired. The third and last issue I have is that i always paid cash at the end of my visits and somehow I have received an invoice for $55. I called and of course the receptionist was sassy and rude so I gave up. Will never go back or refer anyone else", "type": "review", "business_id": "e_U_FnpdKVgNb4mUN2cU_Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YKDw2WGj-MQjz7eRsb5FHg", "review_id": "fpJ_Bgho7G3E-_WWaMJpjA", "stars": 3, "date": "2010-06-04", "text": "Don Don is a restaurant I find myself missing now and again, it's probably my favorite restaurant in Carnegie. Simple setup, just a small restaurant with a few tables and a TV. Oddly enough I think my favorite thing to eat there is the wonton soup, never had better. The food is average but I always enjoyed eating there, great service and a cheap place to get Chinese food.", "type": "review", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_CtkjL-e6O_lMShkN6HuSA", "review_id": "nuZlz-65cXIsLZPGk6EwDw", "stars": 1, "date": "2011-01-12", "text": "Take it from me; avoid this place at all cost.  The only time I go is when I am starved and don't have the energy to cook or get edible food.  And then after I have been kicking myself.", "type": "review", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RJgfj-6Uq-lyiPJJcyCVlQ", "review_id": "M28dSKnyInjQu0I9NJlfig", "stars": 2, "date": "2013-03-29", "text": "Far away from real Chinese food. Doesn't even taste good as American style Chinese food.", "type": "review", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fTg6Rz2Rs1LLYN_U7TJbcQ", "review_id": "QRRumDA7QEUGwQ2sD_KswA", "stars": 2, "date": "2013-06-10", "text": "I used to order takeout here once every month or so. The food tastes average and the price is good. It's your typical low-end Chinese place. \n\nThe last (and final) time I ordered here I just so happened to be picking up my order while a health inspector from allegheny county health department was making his rounds. While I was waiting on my food (which took much longer than usual) the inspector was pointing out violations. He also requested a copy of a certificate that the man behind the register was unable to produce. The inspector looked at me like I was crazy for waiting on my food despite the obvious poor conditions.  \n\nAs for the rest of the place - it's always been kind of dirty inside. The carpets are just FILTHY and the walls match. There are always children's toys scattered about the floor because the owners children are always there, so be careful not to trip. \n\nThe workers do seem like nice people just trying to make a living but when it comes to cleanliness Don Don is lacking.", "type": "review", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YxSD5yuMozdW1-yXKgkvvg", "review_id": "B3UUywTg0CG09Y5vnuJtlA", "stars": 4, "date": "2014-05-19", "text": "Delicious Singapore noodles and seafood delight. Crispy flavorful crab Rangoon, and cold sesame noodles done well (but could've used a bit more sauce). Excellent real Chinese food, friendly service.  Restaurant ambience: high school cheap date quality.", "type": "review", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "d3w57QihQsYNDmZi3x1x8w", "stars": 3, "date": "2014-08-04", "text": "I came here with two friends prior to visiting Apis Meadery next door this past weekend.  I ordered the General Tso's chicken, and my friends ordered the sesame chicken, crab rangoon, and another appetizer (egg rolls?).  They ordered the combo with less meat, and I ordered the one with more--the names were very similar, which I found confusing. The food took quite a while to come up (~15 min.), so I'd suggest calling ahead if you're in a rush.  While we were waiting, the woman behind the counter yelled at someone over the phone in Chinese, and then at a guy who came in to pick up food for delivery (probably the same person).\n\nTo be honest, I'm not much of a fan of Americanized Chinese cuisine (I lived in Singapore for 3 mos. and have visited Hong King and Japan); it's been awhile since I've had it, and this dish reminded me why.  I don't care for the overbearing sweetness and thickness of the sauce, nor do I care for the pre-cut meat in the dishes (I like to cut up my own meat, thank you very much), so the flavors and textures don't do much for me.  Having said that, my friends claimed this was the best Americanized Chinese fare they'd had in PGH (and they live in Squirrel Hill!), so if you're a fan of this cuisine, you can take that into consideration.\n\nIf nothing else, this meal provided us with some much-needed food to absorb the alcohol from the mead, which I appreciated.", "type": "review", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7W9DeA_sCLrWl4O8mdIYhw", "review_id": "GAlyz9rblfsnpqhJjpCPHA", "stars": 1, "date": "2015-01-06", "text": "All I can say is the worst! We were the only 2 people in the place for lunch, the place was freezing and loaded with kids toys! 2 bicycles, a scooter, and an electronic keyboard graced the dining room. A fish tank with filthy, slimy fingerprints smeared all over it is there for your enjoyment.\n\nOur food came... no water to drink, no tea, medium temperature food. Of course its cold, just like the room, I never took my jacket off! The plates are too small, you food spills over onto some semi-clean tables as you sit in your completely worn out booth seat. The fried noodles were out of a box and nasty, the shrimp was mushy, the fried rice was bright yellow.\n\nWe asked for water, they brought us 1 in a SOLO cup for 2 people. I asked for hot tea, they said 10 minutes. What Chinese restaurant does not have hot tea available upon request?\n\nOver all.... my first and last visit to this place. The only good point was that it was cheap, and deservingly so.", "type": "review", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CiCmxCruMvbXtjQP5FhbLg", "review_id": "0GS3S7UsRGI4B7ziy4cd7Q", "stars": 4, "date": "2014-06-20", "text": "Went for breakfast on 6/16/14. We received very good service and meal came within a few minutes.Waitress could have smiled more but was friendly. \nI had a Grand Slam... it was more than enough food. \nMeal was very tasty... We will definitely go back. \nIt is a popular Denny's.", "type": "review", "business_id": "wqu7ILomIOPSduRwoWp4AQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bbYn77XD_aAeFL-lwV7GBA", "review_id": "YFsac440vY3U5iijvPOKSg", "stars": 5, "date": "2014-07-29", "text": "I love their stakes and i come here every week just to get the t bone steak, it is completely delicious! \n\nGreat atmosphere, there is always a lot people and the waiters are nice; food portion is great as well!", "type": "review", "business_id": "wqu7ILomIOPSduRwoWp4AQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UxfFAw2-cTpeWvRROF1HEw", "review_id": "f0FRVCf93O7rlfgwV7OoKw", "stars": 5, "date": "2014-09-02", "text": "Perfect time with hubby, after work which is 4 am and you can still have a hot nice meal, waitress was such an adorable girl. Her arm was broken or smth but she still dis a great job!\nStrawberry lemonade was just smth i have been craving for for so long but did not know what it was :) \nStrawberry milkshake, nachos and t bone steak is smth we never stop ordering!\nIts always nice when u go late at night like us, it is not crowded, not noisy, nice music playing and always nice people around. \nIf you want smth quick and it is late at night then i would say Denny's!", "type": "review", "business_id": "wqu7ILomIOPSduRwoWp4AQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3eystYBQINAG1tlRBk215A", "review_id": "7ezUOJJ6g-QMwKGHypf7cg", "stars": 5, "date": "2014-09-25", "text": "This location never disappoints!! Food is always consistently great, and if you come at the right time, (witching hours) you may see the cook singing and dancing along with the music in the back. And it is awesome! ! Love this place!!", "type": "review", "business_id": "wqu7ILomIOPSduRwoWp4AQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IbvOxKSps_K5wa3a2_jc-Q", "review_id": "gdoTWFXJvibNBPQdjj8SLQ", "stars": 4, "date": "2007-09-11", "text": "I belong to this gym...  I live in the South section of Pittsburgh, and I find that this gym is not too far from me.  The staff is friendly, the equipment is quite good.  You get two free personal training sessions when you join.  They have lots of weights (which my boyfriend uses) and a decent cardio room.  The only thing I would say is to increase some of the cardio equipment.  Water is only $1 a bottle!", "type": "review", "business_id": "1u2NauOy8xDj7aFQET680A"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CFh9jAl5_DUSgNBA5bP5RQ", "review_id": "KqYkEANHt5PoVMhOiBRDew", "stars": 2, "date": "2012-12-29", "text": "I bought a three month membership last year, mainly to attend the Silver Sneakers classes. I was in my early sixties and hadn't exercised in a while. I tried the evening classes but they were very crowded and difficult, so I tried a morning class for seniors. I like to stretch out before my class actually starts, so I went to the tail end of a yoga class. The women in this class were very nasty to me and told me that I wasn't welcome to stretch out in their class. I never went back thanks to the attitude of the other members. I didn't feel welcome here. I complained to the manager, who said that I was welcome to stretch out in whatever class I wanted to, but the hostility of these yoga students was very evident. Do they think that this is their private gym?", "type": "review", "business_id": "1u2NauOy8xDj7aFQET680A"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "o22C4GhMh0mv9ldqPD0f1g", "review_id": "cv1sIoNmolX4gsR8PdtVWg", "stars": 4, "date": "2014-08-07", "text": "I really like this gym. It is nice neighborhood gym and unlike big gyms they don't have big contracts and they have flexible memberships. Great selection of classes. All the instructors are very good knowledgable and motivating. All the staff working there are super nice. Their selection of the equipment is good too !!", "type": "review", "business_id": "1u2NauOy8xDj7aFQET680A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yajxgpF8rRRHr2mqMK-73Q", "review_id": "EUnCkH6BVFgK8gomQEMJLA", "stars": 1, "date": "2014-09-01", "text": "If you like being greeted in the morning by a gym worker slopping down eggs from a frying pany instead of working....this is your gym....complain to the manager and she gets nasty....try getting in touch with the owner....impossible!  Most unprofessional gym ever!!!!", "type": "review", "business_id": "1u2NauOy8xDj7aFQET680A"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "4d6gHTch3Mytp02o-tzV9Q", "review_id": "QxR3WHUjmWh5xIyqfJkfsw", "stars": 5, "date": "2007-08-14", "text": "I brought my husband and my parents all to Papa J's last time my husband and I were in Pittsburgh. My parents are really picky about their italian food, usually they drive places in east bumf*@ (tarentum, ligonier...) to get their capital I-talian.\n\nMy pop is kinda grumbly, and getting him to try something new is like pulling teeth. The only reason I got him here was becuase they were on their way to drop us at the airport.\n\nWell, my dad goes back now regularly and that says a lot, considering he lives in Murrysville. \n\nThe first good sign Dad was happy was that he seemed impressed when it was open- it was noon a few days after Christmas. Second good sign was that Dad ordered wine, at it was only 1 pm. Dad, while not a teetotaler, rarely has a drink before 5 pm so I know he was anticipating a good meal. The kicker was that he was so happy he left our waitress a $20 tip on a $50 meal. \n\nCan I say, I live in Texas now and I still relive this afternoon back in December? I had chicken picatta...it was perfect. My dad had eggplant rollatini, my mom had a pizza, and my hubby had basic pasta and marinara. It all was amazing, delicous, and inexpensive. In Austin, you can't get a decent italian meal, much less a decent italian meal for under $50 for four people.\n\nI know there are so many good Italian places in Pittsburgh but I just think back so fondly on this day...when me Dad liked someplace I took him :)", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-kep1OMASW13zZxbrRmXag", "review_id": "kmCetnNJ4n9BaL-m3QUnyA", "stars": 5, "date": "2008-01-13", "text": "Papa J's is by far my favorite restaurant in Pittsburgh, my hometown.  I eat there almost every time I visit, and everything I've ever ordered has been fantastic.  Fresh ingredients, simple preparation, reasonable prices.  Also, they make the best pizza in town HANDS DOWN.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GFLvPozOh5m_n1MYGdHpFQ", "review_id": "ccuOXwBqkTjEPbe9WvVAxQ", "stars": 4, "date": "2009-08-15", "text": "This is one of my husband's fave restaurants in town. My husband generally orders Chicken Parm, which is very good. Their sauce is quite good. They serve fresh bread with a plate of olive oil and balsamic vinegar for dipping -- yum.\n\n I generally order one of their house salads (think it has a specific name, but can't recall off the top of my head) which has mixed greens and I get it with blue cheese, pine nuts and their yummy vinaigrette. A tad pricey for a salad that's just lettuce and cheese (I want to say about $8 with the extras), but really good. (Especially with some cracked black peeper.) I tend to follow this up with a smaller plate like their red pepper app or the greens & beans. \n\nThe place has sort of a rustic atmosphere and can be on the loud side. It has a comfortable feeling. It also has a solid wine by the glass selection -- better than a lot of places in the 'burgh. \n\nUnfortunately, we've never had dessert there b/c we get so full of bread and dinner!", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_S8zEPxR0DRxIJ6YjoObfA", "review_id": "VYC9I0E493hicnup49FbQw", "stars": 4, "date": "2010-02-17", "text": "Thanks yelpers for this find. The service, the plating, the ambiance were wonderful. I had the eggplant parmigiana and it was good - but different. It was thinly sliced (like deli meat) and wasn't breaded, it was fried in a very light batter.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cqox9oe5IAS9tR7iYhtX7Q", "review_id": "5JJ9eapKuO6wh0fkx6EeNQ", "stars": 5, "date": "2010-02-18", "text": "This place has been a favorite for 20 years since we returned from a trip to Italy having several weeks of fabulous fresh food, and couldn't think of any place we wanted to eat. Papa J's measures up to our expectations with great salads, bead and wine. I'm partial to the eggplant rollatini and my husband likes samplers, ravioli, fish, white pizza. I like the space with exposed brick walls-there are knowledgeable servers. Sometimes it is a bit loud- more noticable when it is empty with a large table nearby. But don't get the wrong impression -it's a great place-consistantly great food.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "072tu2_MFWmw-jb1O6DQYg", "review_id": "LMl9TSOWrPXp7Cs4oVrLlg", "stars": 5, "date": "2010-03-13", "text": "Great, authentic, classic Italian restaurant in one of the most unlikely places. \n\nI grew up eating here and make a visit nearly every time I come to town.\n\nTry the fried calamari \"Roman Style\" for a little kick!", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "MinNxg1k6s9xpZKRw41NnA", "review_id": "EtLICMCs9zeqXxuyXTGj5A", "stars": 3, "date": "2010-07-21", "text": "I've been to Papa J's twice and had mixed experiences.\n\nBoth times I had the banana pepper appetizer, which is great and goes really well with the FRESH and delicious bread and cheese they give you at the start of your meal.\n\nFor entrees, me and my girlfriend have had mixed experience.  I've had the fish sandwich (very good) and the eggplant parm sandwich (okay).  My girlfriend got the salad with bread and basil on it, but the basil was over powering and the bread was soggy with the dressing. \n\nThe service is also a mixed bag.  The first time our server went out of her way to take care of us and even MADE me cocktail sauce for my fish sandwich.  The second time, the server was lackluster, didn't know anything about the menu and wasn't able to take proper care of us.  \n\nI would return to Papa J's, but I my terrible experience last time isn't enough to say it would be my first pick of places to eat around Carnegie/Robinson.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "UCOssThZufcqehMMe6OA0g", "review_id": "5BwtufRF36b-PtZyyS90ug", "stars": 4, "date": "2011-01-13", "text": "I went there for dinner last night with a client.  This is second time I visited.  I had a scotch and he had a Guiness.  The (-1) is for drink selection. Just stock some better beers and higher end scotch and you're five stars.\n\nWe started with the meatballs covered with Provolone and other blessed goodness.  These did not disappoint.  I had a four cheese pizza with sweet sausage and garlic.  It was fantastic.  They have so many good dishes, but I wanted the pizza last night.  I couldn't finish the pizza - way to go big medium pizza.\n\nI finished up with a coffee.  The parking can be a bit of a challenge on the street, but it's a small town atmosphere in Carnegie, PA.  I love the downtown there.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9cCTmiJ7hz35rHIdr8n9kA", "review_id": "2Ff_JGpkJSifcQ8gW7bK9A", "stars": 4, "date": "2011-03-13", "text": "Yay, I'm a fan but sometimes service is a little slow, it was very good for us this visit.  Go to Papa j's every once in a while but mostly for the White Pizza.  It is the best white pizza I have ever had.  Order the white pizza on our visit this  weekend... it has garlic, spinach, feta cheese and we usually add some veggie on top.  It was delicious!  Order fried calamari and it was OK...note to self next time try the calamari roman style.\n\nLike the dinning room with the hardwood floors and bright lighting.  \n\nThe bar was jumping thou never go to the bar.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lbdzh6Qn5S1O5ENrr7n2wA", "review_id": "2ihNipOT-nUC0uZvC50R0A", "stars": 1, "date": "2011-03-14", "text": "Terrible service.  Food unremarkable.  Waiter disappeared for 45 minutes to serve larger group due to staffing mismanagement.  Saved his tip by discounting meal after I complained.  All and all, a very crude and unpleasant dining experience for me and my guests.  Not to be repeated, never again!", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "k-a1aAKB0f6w5sHDDEO4IA", "review_id": "G-gqp94DI9ZX3Qp4HdMCmA", "stars": 2, "date": "2012-01-02", "text": "I have to say that I write this review with much regret, because I have always loved PaPa J's. But my recent experience there has changed my mind a bit. \n\nFrom the minute we were seated, we were greeted by a server that was clearly inexperienced and didn't know the menu. As I said before, I've been to PaPa J's a good handful of times so I know the menu decently well, but the server couldn't explain any of the questions I had about a couple new dishes I was thinking about trying. I swear this guy must have just looked at the menu for the first time a few minutes ago.\n\nBut it wasn't just the knowledge of the menu. It was one thing after another with our server. My wife asked for a glass of water 4 times until she finally got it (at which point the meal was over, so we didn't care at that point).  I mean come on, for a restaurant of this calibre and price is it too much to ask for a glass of water? There was no one filling up water.\n\nMy biggest complaint, however, is what happened with our meals. My dad and I both ordered the trout special (trout with roasted red peppers and lump crabmeat). Instead, the meal that was delivered to both of us was trout with a heaping pile of spinach and mushrooms. Not what the special was at all.  And by the way, that item is on the menu as a regular item so whether or not the mistake was made by the server (which, we are sure it was) or the chef, who knows for certain. Not to mention, though, that a good server wouldn't have served us that regardless. \n\nBut before you think we had an unusal experience that was all due to a poor server, let me continue. When we informed our server of the mistake, he didn't really believe us until he checked his order sheet, and then he blamed the error on the chef. At this point, the meal had been sitting (because it took us forever to flag this guy down again) so the trout was basically cold. The server then said he would have the meals re-made. So, he took the meals back to the kitchen. Meanwhile, of course, my wife and mom are eating their meals and my dad and I are sitting there with no meals. Also keep in mind that my wife still had not gotten the water she had been asking for, and my iced tea had been refilled with a soda (yes, believe that or not). All the kitchen did was scrape their \"mistake\" off of our fish! They didn't remake anything. Our fish was served to us again with little pieces of spinach and mushrooms sticking all over it. Quite frankly, the fish wasn't good at all. I honestly would have rather had a fish sandwich from McDonald's that night. The server never did anything to try to make our experience better - he knew we weren't happy, but never offered anything such as dessert on the house. I'm not looking for a handout, but our experience was just plain awful that night. The guy never really even apologized for the mistake. Normally, I may have asked for a manager, but at this point I was ready to just get out of there (plus, we had to be somewhere else that night).\n\nMy opinion... for the money, there are many other restaurants I would rather eat at.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tx4XvjDlactzL7SlNnR9XQ", "review_id": "5b5WisVblTVpl8qYVCi5Yg", "stars": 4, "date": "2012-01-02", "text": "This is a regular go-to for me. I love the food and the service. They always have the wine that I like and the food is always delicious. I suggest trying the flourless chocolate cake in the front of the store (in the section where you can buy stuff to take home). It is sublime and makes you want to go to a special cozy corner just to eat it and revel in its velvety loveliness.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rS5-P1HVtZMyIQ_f1Es0uA", "review_id": "PCfm-BX0OiT70o5Q-sm3DA", "stars": 4, "date": "2012-03-18", "text": "I thought the interiors were very nice.  We stopped here on a Friday night & I was glad they weren't busy because nothing else in the area looked appetizing.  \n\nMy daughter & I split a chicken parm sandwich, which was really good. Instead of it being served on a hoagie, it was served on thin bread- like focaccia or something.  It was pretty good- little messy.\n\nThe desserts looked amazing.  I thought it was pretty cool how you can watch the cooks prepare the food from outside.  The kitchen is situated on a corner with lots of windows.\n\nI would return.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PRTVZdLWYmhozxkplGA9qQ", "review_id": "CC1lVb3PEQWqJNHDAK7PKg", "stars": 4, "date": "2012-04-01", "text": "san francisco california visitor liked the food and the local is great. I am thinking about relocating to pttsbrgh area. I liked Carnegie because u can stroll down Main street and hit a couple places for lunch. I imagine this place would be crazy busy on friday or saturday night. we ate a lunchtime and it was nice.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "iCL1r6fQeI3-EOEYGyh0FA", "stars": 2, "date": "2012-08-02", "text": "Coming here you get the feeling they haven't changed much.  The tables, the decorations, the menu.  All the same.  Does that make you a little worried?  Yes.\n\nI ordered the mushroom ravioli and it was... oily.  Very very oily.  The actual ravioli was okay, enough mushrooms.  but it was oily.  Did I mention that?  \n\nAmbiance, like I said, left much to be desired.  I don't think I'd have this place on my list of \"musts\" for downtown.  Much better restaurants to visit!", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "tCNt0WFUwqNC997W7kk3Ew", "review_id": "s6sT4Ob1sGeJ8k6MqDLlmQ", "stars": 3, "date": "2012-08-12", "text": "Had dinner at Papa J's with a group of 6.  I loved how the restaurant is in a old brick building with large windows. It felt like a neighborhood restaurant. On a Saturday night, the restaurant was full but not crowded.  We were seated in a room with poor acoustics.  It was difficult to hear people at our table and the waitress.  While she tried, I can see the asperation in her face when she had to repeat the specials to both sides of the table.\n\nPeople ordered bourbon on the rocks before dinner which seemed watered down, while my lemon drop was made nice.  The bread was delicious!  Can you describe it to be creamy?  The fried zucchini was lightly breaded and not too oily.  It was a large portion made up of 2 sliced zucchinis.\n\nWe ordered a variety of dishes.  The pasta dish was dry with more pasta than sauce or meat.  Those who ordered the fish special thought it was delicious.  The shrimp dish was enjoyed as well.  I had the chicken marsala which was pretty good.  The marsala sauce wasn't too thick, and the chicken moist.\n\nHard to tell if the deserts were \"homemade.\"  The tiramisu and spumoni were small in portion and meant for one. \n\nOn the whole, I was on the fence with my overall impression of Papa J's.  \"A-ok\" probably is the best way to describe it.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CLy1pUDZWUyIMUjRouDFlQ", "review_id": "6RCpk-w1u7hwGHuy9GMWVA", "stars": 2, "date": "2013-03-04", "text": "Although the first impression through the door is charming and the aroma enticing  as you enter this restaurant- much can be improved upon for the prices asked for the dining experience. Our group of 7 had called a week ahead and were seated in the back of the far dining room, right by a door where clinking pots /pans and  dishes were heard throughout our meal, as well as a Darth Vader type noise coming from the ceiling vent. Our waitress was not knowledgable of all menu items, and three of our  very simple requests did not come out as ordered. ( dressing on the side of a salad,  less feta on an entree and no oil on another entree) The waitress blamed it on the cook, but did offer to get one entree changed. Also we were asked if we wanted pine nuts, feta or Gorgonzola on our salad and then were charged 2.00 extra per item in addition to the salad price (6.99) which brought the salad up to 10.99 ! Outrageous !\nThere is so much possibility for ambiance in this restaurant , but they miss the mark on service and atmosphere. I will most likely not return. Very overpriced for the quality and service.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "8xckX9C5cojQaT32P927iA", "review_id": "SuGIqHPvC4naRErEOTBs9g", "stars": 4, "date": "2013-05-26", "text": "Very good restaurant with very good food at a pretty reasonable price.  We had a birthday dinner here with seven girlfriends. The waitress was very efficient , but not very friendly. Our orders came out hot and excellently prepared!  Try the tilapia milanese , it's excellent. Best steamed broccoli Iv'e ever had.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D-tr1j_30GwKSB3e_WOYCg", "review_id": "wuD4dsTkOCwbeAhlNBkM2A", "stars": 4, "date": "2013-09-29", "text": "Just to start off, we were a party of 12, which is always a little difficult.  We were celebrating 2 birthdays.\n\nWe LOVED the food, it was delicious. My husband got a chicken parm sandwich, which is served on a yummy flat bread, and I got the chicken basil pizza ( i got an 8 cut and several ppl tried it) we all LOVED it! It was stunning.  It was made with a very delicious crust, nice and crisp, not soggy (like pesto pizza can get)\n\nThe one waitress we had JASMINE, was fantastic!  She was bright, friendly and very knowledgeable about the menu.  She took extra time with the older ladies in our group to help them with their selections... \n\nNow... the other waitress.. Mary something was so incompetent...  She was awful and rude.  She missed 2 people on that side of the table failed to take their order and when we said something she said 'well they didn't speak up!' Ugh.  Then when it was time to sing and cut the cake, my sister in law said 'oh hey can you get the cake so we can sing?'  She came back, cut the cake (all crazy with some huge pieces and some super small pieces like she never in her life cut a sheet cake) and we didn't even sing!  We were mad!!\n\nThe place is so pretty, they have a new addition that was just built within the last 2 years (according to my father in law) and its really nice.  They look to have a cool bar area with some modern couches and a really sweet look.   \n\nSo good food, great looking place.. one bad waitress. Prices are about middle of the road for an authentic Italian place, nothing crazy.  All in all, we'd like to go back again, but we want Jasmine!", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vsL3r0yLuU5lWUe-nsujYQ", "review_id": "yiVdAi9xicwzMd8LGp9L5g", "stars": 4, "date": "2013-10-18", "text": "I am amazed that people can write negative reviews about Papa J's.   I have been a return customer since the early 90's and the food quality, and service, are way above average......and especially for this price range.\n\nKudos to management for maintaining such a level of quality and freshness.   Nothing we had tonight was disappointing, and we over-ordered because each dish was delectable.\n\nThe best item tonight was the Mozzarella appetizer \"cradled\" in Bread with an authentic marinara.\n\nThe white pizza with sun-dried tomatoes was, as usual, out of this world good.   The scallops special appetizer was phenomenal.\n\nWE WILL BE BACK.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fm0SvFKHl7Vm-JYJAqvo5A", "review_id": "QiUfMSDKElIVk1J8BDY7fA", "stars": 1, "date": "2013-11-10", "text": "Absolutely Awful Service.  Went to Papa J's awhile ago and the service was bad - the waiter was surly, rude and unhelpful..  Decided to try it again since it is close to Stage 62.  Big mistake.  Greeted by a dour manager that seemed mad that we had a reservation. 30 minutes to get a glass of wine.  At one hour and 45 minutes complained to the manager that we still had not received out entrees.  He said 'What do you want me to do about it?\" and said they had a busy night.  This is when tables around us sat empty. I then had to go back to the manager to give us our bill so we could get away from this ruined evening.  The bill was prepared incorrectly. If you want average food and terrible service, this is your place.  We will never go back.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xb6zEQCw9I-Gl0g06e1KsQ", "review_id": "wGeQZ-JuAOdHGpUdr6g4qQ", "stars": 4, "date": "2013-12-03", "text": "The menu has lots of choices and the food is great! The Resturante has been expanded so it's pretty large. The new section has door that they leave open during nice weather which makes for a nice ambience! The bread is great and fresh baked daily!", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0fHA8u20wh1z1u0ANsiBLA", "review_id": "63gqebKCZLt3ESZHBJAy2g", "stars": 1, "date": "2013-12-26", "text": "I have been to this restaurant twice and was disappointed both times. I won't go back. The first time we were there almost 3 hours. It took forever to order and then forever for our food to come and the place was empty. When I complained the manager was very rude and tried to blame us for taking to long to order. It made no sense, how could we order when the waitress wasn't coming to the table? After arguing with me he ended up taking $6 off of our $200+ bill. Ridiculous. If it were up to me I would have never returned. Unfortunately my family decided to go here again tonight. Again it took a long time to get our food. My food was cold and bland, my kids food was cold. My husbands salmon was burnt to a crisp and my sister in law took one bite of her trout and refused to eat any more because she claims it was so disgusting. The wedding soup and bread were good, but that's it! My drink sat empty throughout my meal and never got refilled even when I asked. Bad food, slow service and rude managers. I'll pass on this place if my family decides to go again. Not worth it at all with all the other good Italian options around.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dKZYPAw7K64Cqbvys4T50A", "review_id": "P_CZFSwcXYOkTvRkQ2aHtw", "stars": 5, "date": "2014-02-24", "text": "2nd times a charm. This place was 3.5 starts the first time I came, but stepped up large tonight.  Waitress was righteous and very fun.  Food was all excellent.  Caesar salad tasty--got with tomatoes big $ on that, fettuccini carbornara with bacon n smoky cream flavor.  Can't wait for the leftovers!!  The white pizza is that star though.  The crust/dough is heavenly and the flavor is top shelf.  I don't throw those accolades out easily, especially on pie, but this joint serves it up.  Good vibe, great service, phenomenal food.  Ill be back.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zJzMAZtNiEOuC2wgDOmm7Q", "review_id": "UcLSql0dfS7dcXKOYU-y-g", "stars": 3, "date": "2014-03-03", "text": "Service was great. Apps delish, specifically the stuffed banana peppers & lentil with ham soup. I think I chose the wrong entree though because I ordered a cod with crabmeat special. The cod was completely tasteless with some crabmeat layed across the top. It all reminded me of boiled fish. Yuck! Note to self. Order the pasta!", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "05ehdct-bF7YLTZTZvB5rA", "review_id": "P0ztxA3bmqA32AqamW60nQ", "stars": 5, "date": "2014-05-19", "text": "I love this place! The food is always so fresh and delicious. The staff is always friendly, as well.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pe4QxbvKhLFHWiypevdmQg", "review_id": "yGDNqOZIP8nvBujq75ZDrQ", "stars": 4, "date": "2014-07-05", "text": "spinach/feta cheese salad:  B-\npesto alfredo penne :  :A+\nCoconut Cake huge piece:  A+\nbread small portions:  B\nService B \nhost seemed grumpy, waitress good, but then she got busy .\nPRICE: Pasta was $15 and the portion smallish more like a $12.99 dish \nARRIVE EARLY ON SATURDAY NIGHT THIS PLACE PACKED after 6pm", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "KZVgUYGt4eww_GwJ2F0MrQ", "review_id": "RnFLiT_uca0vllufwN7qIg", "stars": 1, "date": "2014-08-03", "text": "We stopped at Papa J's last Friday night (8/1) for a round of drinks. There were 7 of us altogether and we had eaten at another restaurant earlier in the evening.  One member of our party walked up to the bar to let them know we were sitting on the couches along the wall, as it was fairly busy that night. In the short time that he was there, a man who was behind the bar looked at him and then turn away without saying a word or notifying anyone else. He then turned to a waitress who had approached the service area of the bar and asked her if  we could have a server take our drink order. She said \"yep\" and then abruptly turned and walked away. At that point, he asked to see the manager  who came a few minutes later. When my friend told him of what had occurred, the manager said \"What do you want me to do\"?\n\nMy friend said \"An apology would be a good start\" whereupon the manager looked back at him and said \"Get out and don't come back\" ???????? Are you kidding????\n\nMy friend is well traveled and frequently stays at higher end hotels and dines at quality restaurants. He was not screaming or belligerent in any way, shape, or form; simply informing the manager of what had occurred. \n\nThat being said, we left and went back to 131 East, where we had previously eaten. The service there was fabulous, as was the meal and the drinks creative and exquisite.\n\nThere are new restaurants that have opened in Carnegie as of late. Papa J's is no longer the only game in town.  Obviously this is the way a simple complaint is handled by management. Appalling!!  Do yourself a favor and frequent any of the other restaurants that are within walking distance of Papa J's. They understand the concept of  customer service.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k-TbSrTfjDO1Hj-eh4Bqmw", "review_id": "kjUbN8EZfgsb8fIYild0hQ", "stars": 5, "date": "2014-09-30", "text": "Finally, great Tuscan-style Italian food in Pittsburgh, not that tasteless stuff that locals think is Italian.\n\nThe bread was warm and fresh. The bolognese sauce was creamy and rich, and unlike most restaurants was made with veal. I love the fresh smell of baking bread throughout the restaurant.\n\nI'm looking forward to working my way through the menu of chicken options, and next time, I'm saving room for dessert! The display of cakes and pastries at the door was amazing.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bmy45XLtOomcc_EvC-lXRQ", "review_id": "mVizSUtJ83AorDoFamS7zA", "stars": 1, "date": "2014-11-21", "text": "Food was NOT GOOD at all! My husband & I ate here a couple weeks ago for the first time. I ordered a salad & basil pesto cream pasta & my husband ordered the spinach & feta pasta. The salad was just a huge plate of spring mix (nothing else in it) with WAY to much vinegar dressing. My lettuce was drowning in the vinegar. My pesto pasta had no flavor (did not taste like a cream sauce to me) & the pesto was so runny/watery & way too much sauce not enough noodles. My husband's pasta had even less flavor than mine. We ate about a quarter of the food & couldn't even finish it. We took it home & it was so bad I didn't even eat my leftovers. And I hate wasting food!! Plus the prices are expensive for the amount of food you get & of course the poor quality. Don't waste your time eating here. There are much better Italian restaurants in Pittsburgh.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kRm_weZiIXfG3TRmCaRVuw", "review_id": "zSAvMmBK6kplHeOlazIj_Q", "stars": 3, "date": "2014-12-29", "text": "Talk about overpriced. $18 for a fairly basic pasta with some obviously frozen chicken chopped up over it. The latter was terrible, thin and flabby and rather unappealing. The pasta itself was ok, as was the sauce. The desserts are pretty good. But honestly, that is a $10 dish whose price has been inflated.", "type": "review", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ky9ypnAdN7RNkUMGRt1RMA", "review_id": "Fvf08zT8Hh08B_qpMcPSmw", "stars": 3, "date": "2013-03-25", "text": "I'm up in the air about how I feel regarding Emmert Dental. Being that it is located in Market Square can be both a good or bad thing. Parking is scarce not to mention you have to pay for it yet you have great restaurants and coffee places around you. The office itself is old and raggedy looking but the staff are young and hip. I think possibly a little too young and hip. My dentist knew what she was doing but I didn't adore her. I'm still working out my bill because they charged me too much on my copay and don't really seem to have all their info. together. After a cleaning and fillings, I think I'm going to look for somewhere else to get my future dental work done...", "type": "review", "business_id": "xxWFOD46ubTSF3nPRM19BA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ky9ypnAdN7RNkUMGRt1RMA", "review_id": "M8-x47ly3dEd3NWd6IpMYQ", "stars": 1, "date": "2013-03-27", "text": "I've decided where I stand with Emmert Dental. They are unprofessional, rude and have no clue what they're doing (behind the desk). I will not be going back nor will I have nice things to say about them.", "type": "review", "business_id": "xxWFOD46ubTSF3nPRM19BA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "y9qnN2hUtzXUfNXeWh2GwA", "review_id": "bCRkJ1rtYSd3vy1KWF3M2g", "stars": 1, "date": "2013-09-28", "text": "Eat at your own risk. The service is terrible, the staff seem to be generally clueless, the management is inclined to blame the staff for their own mistakes, and there's no sense of FAST in their fast food. When we came, half of the menu board was still on breakfast, and it was 4:30p. The only thing they have going for them is that the food is hot and tastes just like McDonald's should. \n\nThen again, the franchise is owned by Rice, and I've come to take terrible service is their MO.", "type": "review", "business_id": "PK6aSizckHFWk8i0oxt5DA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "5iYis_-EF5RDfjo9yPsoFw", "review_id": "AnUj0CQJdd6Anz0fKFeV8A", "stars": 1, "date": "2013-12-04", "text": "My expectations for McDonalds are t rarely high. But for one to still fail so spectacularly...that takes something special!\nThe cashier took my friends's order, then promptly ignored me. I had to force myself in front of a cashier who opened his register to wait on the person BEHIND me. I waited over five minutes for a gigantic order that included precisely one kid's meal. After watching two people who ordered after me be handed their food, I asked where mine was. The manager started yelling at the cashiers for \"serving off their orders\" when they didn't have their food. But neither cashier was anywhere near those controls, and the manager was the one serving food to customers and clearing the boards.\nThe manager was rude when giving me my order. She didn't make sure that I had everything ON MY RECEIPT, and never even had the decency to apologize that I felt I was getting poor service.\nI've eaten at various McDonalds restaurants for over 30 years. I've worked at more than one location. I expect bad days, bad moods, and the occasional mistake. But I have yet to have a decent experience at this store. It will remain a place I avoid unless someone in my party needs to avoid illness from low blood sugar. Perhaps I should go back to the racially biased service of Steak n Shake instead!", "type": "review", "business_id": "PK6aSizckHFWk8i0oxt5DA"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "Oc-ZZCXRsCzCXAHS4UVvoA", "review_id": "m-sb0OvibseecU06dnfYYg", "stars": 1, "date": "2014-06-01", "text": "I've tried to give this McDonalds a chance but my patience has run out. The only reason why I came here as much as I did is because I like the $1 iced coffees. But it's not even worth it. This McDonalds is poo and so is most of the staff. \n\nWhenever I want to go through the drive-thru I can't because there is a line of cars wrapped half away around the building. And even when the line is shorter there's always a hold up of some sort. So most of the time I just park and go inside the restaurant. \n\nToday was a horrible day. I ordered an iced coffee (no cream or sugar) and a chocolate chip cookie. It only takes 30 seconds to fill a cup with coffee and 30 seconds to take a cookie out of the case. I waited 10 minutes!! Sorry but that's too long just to get a coffee and a cookie! It's not like I ordered a meal! During that time I saw people come in after me and get their milkshakes and iced coffees within two minutes! WTH?! I told the petite sleepy eyed cashier I wanted my money back! Her eyes opened wide in surprise, like I really woke her up or something. She said,\"Youre the one who ordered the iced coffee? I can get it for you!\" For real? She was the one who took my order! I told her I waited too long and I just want my money back. The manager offered to make my iced coffee, but  I refused because I had just had enough.\n\nThere are *few* employees there who work hard but everyone else is dragging their feet. There is no organization or teamwork, everyone is scrabbling. It looks like none of them want to be there. I used to work in fast food and I know it sucks, but come on!\n\nI'm sorry but I can't recommend this Mcdonalds. It's poo. I'm not coming back here anymore. Guess I'll be going to Starbucks- and their iced coffees taste better anyway!", "type": "review", "business_id": "PK6aSizckHFWk8i0oxt5DA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8GccAq9PTpIWlp0gnCHoRQ", "review_id": "QTVZffco48weyu5H0YF57g", "stars": 1, "date": "2014-10-05", "text": "This McDonald's is so bad it's amazing.  \n\nOrder:  Big mac, large fries, diet coke.\n\nThe soda machine was broken.   No sodas.\n\nThen I got to the window.  \"We rang you up for medium fries.\"   (Not what I asked for)  \"Well, if you want a large, you're gonna have to wait 4 minutes.  We just started a new batch.\"\n\nLeft with:  Big mac, medium fries, no coke.\n\nActually, now that I think about it, this was one of my better experiences there...", "type": "review", "business_id": "PK6aSizckHFWk8i0oxt5DA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bSkco4ZdB7REFtDsJUVrDA", "review_id": "RDPh_38RwN9ZyT6B2RVB6w", "stars": 5, "date": "2012-05-24", "text": "This company represents a honest and caring company that cares about their community.  They operate a variety of businesses and restaurants including the Eat n Park locations, the new Porch in Shenley, Six and Penn Kitchen, and the new upcoming Hello Bistro.  I cannot wait to try all of their dinning places.", "type": "review", "business_id": "sRqB6flj3GtTZIZJQxf_oA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "oLDu_8VXEljkKEmv1XIOUw", "stars": 3, "date": "2012-08-27", "text": "They burned my fish and they burned it bad.  Ordering fish at Eat'n Park is always a gamble.  I just never know how it's going to turn out.  I'm a risk taker so I ordered two pieces of baked lemon sole. \n\nWell it went terribly wrong.  My waiter came out and said, \"They burned your fish, so I had them put two new pieces in the oven.\"  I was impressed by his honesty and didn't mind waiting for two new pieces.  \n\n I gladly helped myself to my boyfriend's french toast while I waited. \n\nThen out of no where another server comes to the table with the burnt fish and sets it down infront of me. With the burnt side down of course.  That just shows the kitchen is not in total coordination.  \n\nLike I said getting fish from Eatn' Park is a toss up. In the end I got two nicely baked pieces of sole to replace the burnt ones, so I left satisfied.", "type": "review", "business_id": "sRqB6flj3GtTZIZJQxf_oA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7DeM4C66zVflYNrZn_Vv9g", "review_id": "RKSwdhP-xQLXm6ShTwknew", "stars": 3, "date": "2009-06-10", "text": "This is a tiny Starbucks and it locations like this (although cute) makes you wonder if your really meant to hang out or just grab your coffee and leave. Leaving is always a good idea at this location anyway since you have a nice fountain in the back with benches and it is a central part of the Waterfront Shopping. \n\nStarbuck isn't my favorite coffee chain by any means. Is it just me or do all Starbuck coffees taste a little burnt and bitter? No matter how trendy, cool and upscale their establishments are I can't get around the yicky tasting bitterness of Staryucks regular coffees. Talk about over roasting a bean...Maybe something has changed with their regular coffee but I have not drank it in about a year. I am not one for soy caramel latte foofy stuff. Still I'll give the establishment tres estrellas for the fact that their espresso is acceptable and doesn't taste half as bad as the regular coffee bean.", "type": "review", "business_id": "3gmBc0qN_LtGbZAjTtHWZg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WMTm9HHRA3EewoxTX1Gleg", "review_id": "rbS5aHwGyDJqiQOZptRJlQ", "stars": 5, "date": "2009-06-24", "text": "Friendly staff, same starbucks fair you get anywhere else.  Sometimes the lines can get long.", "type": "review", "business_id": "3gmBc0qN_LtGbZAjTtHWZg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bSkco4ZdB7REFtDsJUVrDA", "review_id": "K527ATdXzEoM8MSd7zBLBg", "stars": 3, "date": "2012-05-24", "text": "I have to agree with Joe on this one.  The baristas are extremely friendly, and the service is great, but the fact that there are no comfy chairs or couches is very unwelcoming.  I do think however that the building is beautifully ans strategically located in the center of the shopping.  I just wish they had better seating.", "type": "review", "business_id": "3gmBc0qN_LtGbZAjTtHWZg"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "5ClL6pOSc0LV0cKn-EXZiQ", "stars": 3, "date": "2013-01-27", "text": "I just realized they remodeled this one recently-ish. Well, in my world recently because it's been a while since I've been here.\n\nThey've added more seating which makes it way more conducive to having a meeting here. Which is my concern during the week. I imagine during the weekend it just fills up with tweens getting their sugar rush before hitting the movie theater. \n\nThe coffee, or tea for me.. Is still same old same old. I don't imagine one single Starbucks will break the mold and make original drinks...", "type": "review", "business_id": "3gmBc0qN_LtGbZAjTtHWZg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-xPKyCJiK9q1OFZ7GCZwBw", "review_id": "kzkG0YHBlNGkCoQuqryKsA", "stars": 5, "date": "2013-06-26", "text": "Great location!  Close to shops and theatre.  Nice staff.", "type": "review", "business_id": "3gmBc0qN_LtGbZAjTtHWZg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q3fFv_ft17OyV-NRF1iQxw", "review_id": "CAqMq5HbwVsyHMWAO95rjg", "stars": 4, "date": "2013-08-23", "text": "Regarding quality of beverage, this is just your average Starbucks. I can't complain but am not blown away either. However, I really like the location of this shop, which is located in the center of The Waterfront's specialty retail shops. Though in the midst of a lot of retail, the surrounding area is very picturesque with pretty green grass, flowers, and a fountain. Hanging out here is very relaxing.", "type": "review", "business_id": "3gmBc0qN_LtGbZAjTtHWZg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6Mflt7fworNLu031TDrDSA", "review_id": "iKwG_wmOX4WvED0NbLbbZw", "stars": 2, "date": "2014-02-11", "text": "This Starbucks is teeny-tiny!\n\nSeating inside is VERY limited.  This is a Starbucks to grab and go and continue your shopping at the Waterfront.\n\nBaristas are friendly and fast.", "type": "review", "business_id": "3gmBc0qN_LtGbZAjTtHWZg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RSExP0-Boucr4QyIEzZi0A", "review_id": "oyOQ8uFapRgu1GTPw3IG4g", "stars": 2, "date": "2014-02-21", "text": "I'm not a huge fan of this location. I think that it was oddly built- the small, alley-like front makes it difficult to get past people on your way to/from the bathroom or tables when it's busy. And there's hardly any tables to sit at. Furthermore, people tend to clog the front on their way in, which makes things particularly difficult (especially in the winter weather). The staff were pretty impersonal to be, but maybe that was due to the high traffic of the place and the time I was there. And the coffee that I had was cold- I'm sure it was probably the bottom of the batch. I'd probably only walk in here again if someone else suggested it before or after a movie or while we were shopping in the area.", "type": "review", "business_id": "3gmBc0qN_LtGbZAjTtHWZg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1NqTU6vbr6xdI1hDUlJ_dA", "review_id": "Fa42fRLXZXifjwqWEfhk5A", "stars": 5, "date": "2014-08-21", "text": "This Starbucks is 5-Star Friendly. The shift supervisor Lucious keeps the energy in there moving and light. He recently helped me with a merchandise return and embodied everything a good manager and all around mensch person should - patience, kindness, generosity and fairness. I left that afternoon loving Starbucks even more than when I went in. It's great that a company and their employees can be as loyal to their customers as their customers are to them.", "type": "review", "business_id": "3gmBc0qN_LtGbZAjTtHWZg"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "MY8IZJkrDgvb7j08QWcjWg", "stars": 2, "date": "2011-11-22", "text": "For someone who straddles the line between sometimes craft-er, this store can seem vast and confusing.  There's rows and rows of baskets and bedazzling jewels and paper and...oh my...scrap booking!  When I want to find boring old felt....it's like...where do I start?  \n\nI'm in a hurry, as always, and I rush in and the first thing I look for is an employee.  No one to be found.  I could call out and my voice would come echoing back.  I run between rows of paper, wood and gosh darn scrap booking....no felt!  Where do I find felt!  Where do I find an employee!?\n\nFINALLY, I find one after 15 minutes of wondering around.  She's incredibly nice and leads me to the felt.  This is not the first time I've been hard up to find help.  I tell her she was hard to find, and she tells me that they're \"low on payroll\" and can't have any one the floor BUT HER!  In that WHOLE store, JUST HER!  That's ridic!\n\nNot a month ago I was, again, in a slight hurry and stood in line for about 15 minutes to check out, with 2 employees at the register and 6 people per line, I gave up and walked out.  \n\nHey Michael, do you pick up what I'm putting down?  You're not making any money because your costumer service SUCKS....in fact, there's no service to be found!", "type": "review", "business_id": "yHTLTr-QN-loO_7XoxS8qg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Q3fFv_ft17OyV-NRF1iQxw", "review_id": "aZQpWM0sg3jsvGpf3-vt5A", "stars": 3, "date": "2012-10-23", "text": "I have been frequently shopping at this Michaels store over the last couple months since I began taking a cake decorating class and hosted a large baby shower at my home. The store has typically had the supplies that I need from cake and cupcake baking and icing to scrap booking supplies. This location is pretty average compared to other Michaels - it's exactly what you would expect when going to this store. It's not a large store, but it's not a small store -- just average.\n\nI do enjoy using the Michael's coupons when shopping. I definitely save a lot of money! Instead of toting around the paper versions, I actually have the iPhone app that has coupons available to use from the app. \n\nMy only complaint is that sometimes it takes a while to check out at this location. I don't normally have a problem - usually only one or two people ahead of me - but sometimes it can be much slower. Today, for example, there were only two customers ahead of me, but one of them was having issues with a coupon. The line began to get longer and longer, and though a couple associates were lingering up front, they kept calling for someone else. From personal experience of being a manger in a retail store, do not linger or let your associates linger near the cashiers without jumping on register. Whatever the reason may be that you are not helping customers, it still appears rude and make everyone more impatient....", "type": "review", "business_id": "yHTLTr-QN-loO_7XoxS8qg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "3cFm9T_PtMLNALGjtCwvNg", "stars": 5, "date": "2013-12-08", "text": "It's yet another Michael's, and it's a very good one. Recommended always. For those who love crafting, Michael's is a godsend.", "type": "review", "business_id": "yHTLTr-QN-loO_7XoxS8qg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Oc-ZZCXRsCzCXAHS4UVvoA", "review_id": "yKewXUKzgt4WYHyEmPKhqg", "stars": 5, "date": "2014-04-04", "text": "I come here pretty frequently for art and craft supplies. Whatever Michaels doesn't have I just order online from a different retailer. Some items are pricey but you can still find some good deals. If you go all the way to the back of the store you can find interesting clearance items. Customer service is average. My favorite time to visit Michaels is when summer is about to end and all the fall and Halloween items are set out. Since I come here often, I know where everything I need is. However, the store could use a new layout.", "type": "review", "business_id": "yHTLTr-QN-loO_7XoxS8qg"}
{"votes": {"funny": 1, "useful": 0, "cool": 2}, "user_id": "T2GzjxlcatJyNiyU7gk_Eg", "review_id": "7nGBcrgovBfv4jf5LpusOQ", "stars": 2, "date": "2014-09-14", "text": "The one good thing I can say about Michael's is that they have a wide variety of hobbies and crafts included in their selection. They've got items for woodwork, painting, knitting, kids crafts, scrapbooks, you name it. The problem is, the variety of products for your particular craft is probably dismal. They've got lots of cool items all over the store that you're convinced that somehow you need. (Because it is soooo cute, and you could TOTALLY do something with it. Right..?) The store feels cluttered because there is so much stuff everywhere. However, if you're looking for something specific, good luck. It's not even a matter of the product being difficult to find in the store. It's that when you find the right section, there's either nothing in stock, or they simply don't even carry what you need. \n\nI stopped in for crochet supplies, and the yarn selection was laughable compared to many other craft stores. I ended up going elsewhere for my stuff anyway. \n\nPlus the prices at Michael's are significantly more than other area craft stores. I usually only stop there if I'm already at tend Waterfront. I'd recommend checking other craft stores first. Unless you need glitter. Especially fine glitter. Michael's has the best glitter selection/quality of any store I've ever been to.", "type": "review", "business_id": "yHTLTr-QN-loO_7XoxS8qg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QSx870G-7sJGGjkH7j3obg", "review_id": "jmTvIRk7pWMtZfgviYh1EA", "stars": 1, "date": "2014-12-06", "text": "You would think their exorbitant prices would at least buy some decent customer service. Not at this location. \n\nThey are totally understaffed and have almost nobody able or willing to help you find anything. This is a problem because they carry so many completely different products that it's hard to find what you need. Expect to wait at least a half hour before getting assistance.\n\nThe organization is disjointed, especially depending on your project. There's even a section called \"art supplies\". I thought that was kind of the point of the whole store. \n\nWhat did it in however was how miserably they packed my picture frames. The place next door wrapped two dollar drinking glasses in paper to protect them, but apparently Michael's thinks a grocery bag is sufficient to protect a nice picture frame in bad weather. \n\nSo, the inevitable happened and I dropped the bag. Now I don't expect every place to be sympathetic, even though it could have been packed better, but when I asked for a refund they were down right RUDE. Hey I did drop the thing, but some empathy would have been nice. I wasn't completely out of line asking because a little bubble wrap and it would have been fine in the first place. I will never be back to this or any other Michael's.", "type": "review", "business_id": "yHTLTr-QN-loO_7XoxS8qg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-V4cUmLyjk6Cv3hS0jw3hw", "review_id": "AMNg45U8jRzwPENj5QmDSw", "stars": 4, "date": "2009-01-04", "text": "Whenever I was at the waterfront I would eat here.  The shakes are good, as are the shoestring fries and baked beans.  The sandwiches are small thin patties of meat so you probably want at least a double.  Overall, pretty tasty.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "WMTm9HHRA3EewoxTX1Gleg", "review_id": "CtxqLHFB80H64X62p_N0Bw", "stars": 4, "date": "2009-06-24", "text": "The food is good and its CHEAP.\n\nI mean REALLY INEXPENSIVE.\n\n$4.00 for a burger and fries. Add a coke and its like $10.00-$13.00 for two people.  Seldom if ever crowded. \n\nService can be a tad slow but hit or miss.\n\nThey also do breakfast and its a great alternative to waiting at eat and park.\n\nTry the shakes, they're great.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nCi-BpCo_4iNFPb4QWUL6w", "review_id": "is3AYmYOOwfspuN5mY5B9A", "stars": 1, "date": "2010-12-19", "text": "I went here at 3 PM between the lunch rush and the dinner rush, and the restaurant was maybe 20% full. I ordered the Chili Mac Supreme to go. I thought I would be in and out within 5-10 minutes. Keep in mind that this restaurant even has a drive-thru; the expectation is quick service.\n\nLong story short, my food never came... the waitress told me (after I had been sitting there waiting for thirty minutes) that the kitchen hadn't even started on my order yet, so I told her to cancel it and walked out. Now I see that others on Yelp have warned about the slow service at this location. Wish I had looked it up earlier.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PwANTxC5mSWGVeSvU1zbYg", "review_id": "MYrWcO00L2tk2g4iri_17Q", "stars": 4, "date": "2011-01-06", "text": "I heart Steak N Shake. I love the fact that the fries are shoestring, the burgers get to you pretty fast, they're a little greasy, and the food is super cheap.\n\nI visited Steak and Shake on New Year's Eve in preparation for an evening of mostly tame partying. I was unnaturally attracted to their Wisconsin Buttery Burger, which is a double patty cheeseburger topped with grilled onions between two buns that have been buttered. Sounds good right?\n\nWell, I get this delicious diet abomination and discover that my buns had been dunked in butter. The pearly gates of cholesterol laden heaven with the triglyceride angels were singing to me.  I took the liberty of increasing my sodium intake by pouring their burger/fries seasoning on the buns and I literally got tears in my eyes....most likely from the salt overload, but possibly because this was one of the most evilly decadent things I had eaten in a long time.\n\nThis is not meant to be a fine dining experience. Service wasn't fast but it wasn't slow. It just kind of was. However, the waitress did get a point for explaining that the order would take X amount of time to all patrons. So I give them a pass for being upfront about it.\n\nNext trip to Pgh is going to feature Steak and Shake - I guarantee it.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Enzdhh-rV5JgC4lgg0IdFw", "review_id": "H1MyeQeyUw4mm8KU_0Yelw", "stars": 2, "date": "2011-03-05", "text": "Well... as Steak 'n Shake locations go, this isn't the best one around--but it is burgers and fries that are open 24-7.\n\nThe milkshakes are good!\n\nPROS: \nAlways made fresh, when you order;\n\nCONS:\nGreasy (but its burgers);\nTakes longer than typical in drive thru (but that's bc they're made fresh!);\nService (on a scale of 1-10, 10 being awesome) is a 4.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cF2CgY-_zNTBtQpaP_CeVw", "review_id": "kFa1X4xoGBh9KTZfuY0KiA", "stars": 2, "date": "2011-05-26", "text": "In general I do like Shake N' Steak, but this location is a hit or miss location!  You never know what kind of quality or service you're going to find here.  A friend and myself went a few weeks back after a movie and it had to be one of the worst trips there EVER!  You can't entirely blame the waitress since she was the only one there for the entire place...poor scheduling on the manager's part. However, while she can't be accountable for the slooooow service, she was accountable for both orders being incorrect.  The burgers were over cooked and the fries were soggie and the milkshake was runny at best...\n\nBy far my worst visit to Steak n' Shake!", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9cCTmiJ7hz35rHIdr8n9kA", "review_id": "YVxgBRtHt7ySocJPPc-YSw", "stars": 2, "date": "2011-06-06", "text": "Rather typical SnS.  Had a good lunch crowd.  Milkshake was good but not as good as EnP down the street.  It took to long to get the burger for some reason, 25 minutes, I realized cooked to order but this is a little long for SnS.  Ordered the Guacamole Steakburger and it only had a small portion of Gauc...not your usual amount..kitchen was not up to speed on portion sizing for some reason.  Definitely did not look like the picture on the website.  Oh well!", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B5WkNWDxZ-baWoQc6DBNHA", "review_id": "z7Hw2U-6uMiKAec_YycSsg", "stars": 3, "date": "2011-10-21", "text": "Ah, Steak n Shake, you hit the spot after a night of drinking. Open 24 hours, drive thru or dine in, with wonderful, cheap greasy burgers, chicken fingers, breakfast sandwiches, and shoestring fries. You're faster (and cheaper!) than Eat N Park. Plus your employees wear those adorable bow ties. Granted, if we were at a fancy party, I might act like I don't know you, but deep down inside you know I heart you.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "M88CCGSukC27xGwRlXEYbQ", "review_id": "QVUEE1sQciQ1ryz7ppIxeA", "stars": 1, "date": "2011-12-20", "text": "The only thing worse than the food is the service.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7JDMwDRjhGFEpsL_vqKyRQ", "review_id": "TYmq32Y_0HYEOWkX7W-obQ", "stars": 2, "date": "2012-04-03", "text": "This place is s l o w....like so slow I have got up and left after waiting 30 minutes and not even being acknowledged by a server. The food is okay. Def not worth the wait. Milkshakes are just okay as well. Booooooo.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "igSbsyeE2C0_17dFt_y_dQ", "review_id": "nfb5FKA5F_NGPsOLsfWlHQ", "stars": 3, "date": "2012-08-09", "text": "Fast food done right, what more can you want?\n\nA throwback to old timey diners, steak and shake is where you get a decent meal at a good price. \n\nMy sisters and I arrived on a Tuesday afternoon around 3pm catching their 2-4 happy hour, which we read on the door upon entry; a lovely surprise. This meant that all shakes and drinks were 50% off! \n\nI ordered the western BBQ burger, which was 2 thin patties, cheese, bacon, BBQ sauce, and fried onions. It came with shoe string fries (my favorite), all for the low price of $4.79. Are you kidding me? What's not to like! The food was actually pretty good! I liked it a lot. Since it was happy hour I also \"splurged\" on a chocolate covered strawberry shake. It was meh. Could have gone without it. The overpowering taste of artificial strawberry really turned me off, but the hot fudge saved it. But, how can you really go wrong with hot fudge?\n\nAll in all, 3 meals and 3 shakes came to $20. A steal. Also the food is good! I enjoyed it. I'd come back.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-OUKIatcSXuF-40IHcarwA", "review_id": "BysFiyYjT0pe3zYS0zSFrQ", "stars": 4, "date": "2012-08-20", "text": "Fast food in a resturant setting.  Considering this food is good and cheap plus you can get food to go.  Must be a reason why this place is always packed.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x1Sc-S5HgZKhlb32yUudVA", "review_id": "8szcv4oGUt-_LXJAShh0Pw", "stars": 1, "date": "2013-01-25", "text": "Food is good, what you'd expect from Steak n Shake. THE SERVICE IS AWFUL. so incredibly awful. expect to take at least an hour for your meal, even when it's slow. I've been going here for years when I want a cheap meal, but the service is so so so awful. Go to McDonalds.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "XbSiZYwYssx92cGJQV2STw", "review_id": "-27CC7PrcFIDQFUbhaStYA", "stars": 1, "date": "2013-04-03", "text": "The service was fast but the food was terrible and so was the service. I had a bus to catch so I couldn't wait around waiting for the check so I went to the counter to pay. She never brought my check, never checked to see if my drink needed refilled, she just mopped the floors. \n\nThe burger was really greasy, the fries were Luke warm and the cheese on them wasn't as flavorful as it should be. As a new Pittsburgher I'm not impressed.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "UD7Y1CqfY6mDmRwIuCf6nA", "review_id": "8hicrPP8-tbt8ys28QnbZg", "stars": 1, "date": "2013-05-14", "text": "I should have known better than to stop here, but I was nursing a hangover and just wanted something quick and simple.  I should kick myself for thinking of this place.\n\nGranted I decided to go to the drive thru and knew there would be a wait.  The sign actually says that the food is prepared when you order it.  I sat for almost ten minutes at the window while my food was prepared.  During that time I wished I could have taken back my order and also wished that I hadn't paid already.  \n\nWhile sitting at the window I decided to just stare inside and watch some of the employees doing their job.  What disturbed me the most was watching the employee making the milkshakes.  Making a milkshake isn't that hard or glamorous of a thing to watch.  What disgusted me was that the guy actually lifted several of the containers for the milkshakes and smelt them.  I mean smelt them to see if they were clean, instead of actually taking the extra minute or two to clean the container.  After witnessing this my food was finally ready and I drove away.\n\nWhen I finally got to eating my food I was underwhelmed.  The fries had no flavor and with the size of the cut it appears you get more than what you ordered.  The \"steakburger\" really, they should just call it a burger, was overpowered by the BBQ sauce on it.  It was all I could taste.\n\nAll this has cemented me in not wanting to ever step foot in one of these establishments ever again.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "y9qnN2hUtzXUfNXeWh2GwA", "review_id": "HNUxIC_8tnG1Z0BpEreLpQ", "stars": 1, "date": "2013-06-28", "text": "I love Steak N Shake. This one, however, leaves a lot to be desired. The food often comes out cold and the servers are apathetic at best. Most of the time, they're downright rude. I highly recommend avoiding this location if possible. There's one on Route 51 that's worth the 15 minutes it'll take you to get there.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9b6REasjDBQAYDpXcKQ2NQ", "review_id": "S1C8EKiCp9bYqD7bOR0TFw", "stars": 1, "date": "2014-05-03", "text": "I like the occasional steak and shake stop.....    but this one has to be the slowest one ever.    The cashier was rude and I could hear her yelling are you fucking kidding me because the register was not working the way she wanted....     wow.... just wow...", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YhT-EwajidHmw71DgRtdYA", "review_id": "IPkcMDJt_pUAkvyiPBgTQg", "stars": 1, "date": "2014-06-04", "text": "Wow. Dirty and slow.  The floors felt like they had the days burger grease spilled all over, and it took 30 m8n to get our take out order.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "4DrkZqFqLcyRcLWuQUXFeQ", "review_id": "sDSM73YPBQmuIo0G_lqa3A", "stars": 2, "date": "2014-07-11", "text": "This place teeters between a 2 and a 3 star review.  I've had pretty good experiences inside, it's usually the drive-thru where things fall a part.  \n\nIt's the rare place I can get a Frisco Melt well, the ONLY place I can get a Frisco Melt!  and that steak burger alone is worth the risk, Walk In OR Drive Thru.\n\nJust take a gun on Weekends, you'll be fine.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JAU8sjjfuZkvVNUJST16RQ", "review_id": "u_IKacoI3L3hs_iH_VnkeQ", "stars": 1, "date": "2014-08-09", "text": "This location is terrible. The drive-thru workers are rude and they give you crap food. I waited 5 minutes before being able to order, even when there was only 1 car ahead of me. Then the lady proceeded to ask me if I would like anything on my burger, and (thinking the pictures on the menu are what they're supposed to look like and they would never false advertise) I asked \"doesn't it come with the fixings like in the picture?\" she then told me it only comes with cheese. So I then went on to tell her what I wanted on my burger. Pulled around and got my order pretty quick, but later when I open my burger its just meat and cheese. The meat is badly burned and cold. It was clear to me this burger was not fresh. I didn't even attempt to eat it, what a waste of a place. They definitely need better workers.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jThUkO26of_9arLY5zUszg", "review_id": "aih60sjdeIFrLjiTv17O_A", "stars": 3, "date": "2014-10-15", "text": "Steak 'n Shake's food is pretty good and the prices aren't bad for the quantity of food. I ordered a grilled chicken salad with no dressing. The salad looked thrown together and was $5.49 for 2 croutons, tomatoes, carrots, cabbage, lettuce and chicken breast. (They forgot the cheese!) The staff wasn't very friendly or helpful and seemed like they didn't want to be there. There usually is a long wait at Steak 'n Shake, but if you catch them when they aren't busy, you will breeze through- drive-thru that is. I do like their food and you can eat healthy options, but the staff isn't helpful and the quality isn't always there.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lARSkAyvPCBOl67dZKMYwQ", "review_id": "PZ5XKOzIkzQOAsn6S-tMNA", "stars": 2, "date": "2014-11-23", "text": "It's okay. Food is cheap but portions are small. For example I order the chicken tenders, and I got 3 little tiny tenders, and a decent amount of fries. Also the restaurant is not really clean either.  This restaurant is not my number 1 choice.", "type": "review", "business_id": "6ilJq_05xRgek_8qUp36-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1dUH7QW07S4DI_okrHhG1Q", "review_id": "RAW1QSmF2sLVTAETqnjlcA", "stars": 4, "date": "2006-03-08", "text": "As far as I'm concerned, Filene's Basement is good for two things: cheap dresses and cheap accessories.\r\n\r\nAs a young performer, I need good-looking dresses for frequent auditions -- and I need a couple, so I'm not wearing the same thing every time. The dresses on the second floor usually range from $30-60 and are good for over a year. It can be hard to find a full-length dress that's not reminiscent of a prom dress, but their selection of cocktail-length dresses is ample.\r\n\r\nAs far as accessories go, Filene's tends to have cheap versions of popular trends. If I feel the need to stock my wardrobe with a transient fad, Filene's is the place to go.", "type": "review", "business_id": "57HN9fGRar_GckBmgHgemA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LYKMElh2u27sPIzoQFaGIQ", "review_id": "Yp2tajj5jjNKLUERky8PIw", "stars": 4, "date": "2007-08-17", "text": "Even when we didn't have a car Filene's Basement was worth the bus trip to the Waterfront. I always find something (usually I find 3-4 things and spend about $60) and better still, I am always still wearing the clothes and shoes 3 months later. \n\nI kind of suspect this is the best shopping in Pittsburgh; it's much better than the usual department stores, better than Marshall's and TJ Maxx and better than the Saks downtown, even when it has a sale. Selection, bargains AND quality.\n\nI like this Filene's better than Gabriel Brothers, which are harder to get to. Gabriel Brothers are a real discount shopper's challenge and I'm afraid I didn't live in Pittsburgh long enough to develop the necessary skills . . . Filene's was still up and running in June 2007 when I left town.", "type": "review", "business_id": "57HN9fGRar_GckBmgHgemA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "IbvOxKSps_K5wa3a2_jc-Q", "review_id": "T7N-WvctpOzf86RwsGAg8g", "stars": 5, "date": "2007-09-20", "text": "Love this store!  Don't always have much luck with the sales, but I always find something I like here.  This isn't your average Marshall's or TJ Max.  I think the green dress I'm wearing is from Filene's!", "type": "review", "business_id": "57HN9fGRar_GckBmgHgemA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7xdvRGaz6fIG6Uh4vPTe2g", "review_id": "CPIQTf3zVD0YoEK0dGJInw", "stars": 4, "date": "2008-06-20", "text": "This is probably my favorite store in Pittsburgh, for the selection and variety of discounted designer clothing. Other stores carry the same stuff but for much, much more, and it's hard to find all the stuff that the Basement carries in one spot. (Yes, I admit that the 'burgh has some cool stores.) I would do most of my clothes shopping here if I were here more often.", "type": "review", "business_id": "57HN9fGRar_GckBmgHgemA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "8hWBnQA_ckmXoRHYPUmm3g", "review_id": "FyS-haDHyYXOgez_55JmQw", "stars": 2, "date": "2008-04-12", "text": "$9.75 for a red bull and vodka? I'm sorry, I thought I was in Pittsburgh, not New York City. Sing Sing, a dueling piano bar, is fun, but it would be a hell of a lot more fun if I could have more than one watered down drink before I warbled my way through \"Paradise City\" with the rest of the crowd.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LhgQq1x4n9ardg1PFo8vgg", "review_id": "923tjSmL0J5FTdiE1wkaxA", "stars": 3, "date": "2008-12-03", "text": "Really enjoyed this a lot more than I thought I would.  The drinks were on the pricey side, but I didn't head here to get smashed.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WMTm9HHRA3EewoxTX1Gleg", "review_id": "6QDeLqMlwtwMz60n1TTcLw", "stars": 5, "date": "2009-06-24", "text": "Had a great time at Sing Sing a while ago with friends.  Friendly staff.  Will return.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_e5drmTJBSV0yiFBrTimtg", "review_id": "-2cBDvZU0tos9jiardbu2A", "stars": 5, "date": "2009-12-13", "text": "Piano Man to the tune of Gangster's Paradise...what more do I have to say? Get there early if you want a seat, $7 cover and really fun crowd. We had sucha great time and I can't wait to go back.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "sceRDMICN8wGl-XYbMJ9eQ", "review_id": "IwH0gE8pyGzIAB3WXjmCaw", "stars": 5, "date": "2010-06-16", "text": "SingSing!!! What a blast! One of my favorite places to jam on Earth!! Cool bar, cool town, cool people... What else do you need!! The piano players are great, funny, semi-good lookin'... I mean dude, you gotta go!!! :) Love me some SingSing!", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j7DlVihvISsgrKFsreR-Qg", "review_id": "7GEU8IZfnqZwTd9zXMPvIg", "stars": 4, "date": "2010-12-08", "text": "Well, the experience did not start well. When we walked in the singing we heard was NOT good. Oy was it not good... Thankfully, it (mostly) improved from there.\n\nSo there were 3 piano players rotating out on a half hour basis. So each was on for an hour and off for half. Of the 3, two were really good. Good singers, good piano players, and very funny. The third guy, well, not so much. Piano skills were fine. But his singing was not. When he sang in his range, he wasn't too bad actually, but too often he reached for notes that he couldn't get to or forced things that just weren't going to happen. Often his jokes fell completely flat. Luckily the other two usually did most the talking.\n\nThey played a variety of songs as requested by the crowd and would do them in unconventional styles if requested (Closer by NIN as sung by a lounge singer was a highlight). We requested Britney Spears' Toxic cause we thought it would be funny and so they gave it a shot and as luck would have it, it turned out REALLY good. That takes some serious talent to pull off. If they didn't know it (like Toxic) they'd find it and play it. They played a wide variety of stuff.\n\nPart of the experience is based on the crowd. We had a couple larger groups (there on a Thursday night, so smallish group in general) that they interacted with a lot, providing some running jokes and comedy. Of course, that also meant some annoying drunk people feeling like they could take over half the show.\n\nMy friends were BIG fans of the super cheap beer specials. $1 drafts from Rock Bottom next door. The waitress wasn't great but it could have been that she was the only one there and the layout isn't that easy to navigate. The bar was generally uncrowded though so getting service there was fast.\n\nIf in the Waterfront for a night out, definitely a place to hit and have some fun if you are up for some fun and willing to sit through a couple clunkers of songs/jokes. Having a fun loving group of friends to mock things with when they go off the rails a bit will help make it more fun.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MJnIMhzm4onnjtzyprVXJA", "review_id": "emGY8AzjqZ3Tmp4tGyL2Kg", "stars": 4, "date": "2011-01-17", "text": "While we were in Pittsburgh for the Winter Classic on New Years Day, we figured we'd see what the area had to offer for NYE. My wife and I, along with my friend and his girlfriend hit up Sing Sing in Homestead. It's apparently located on what was the site of one of the largest steel mills in the area. When it closed they turned the entire site into a large outdoor shopping and entertainment development. The only remaining artifacts from what once was, were the nine or so original mill smoke stacks still standing at the primary entrance. Pretty cool.\n\nSing Sing, which is a piano bar, is attached to the Rock Bottom Brewery and serves a selection of RBB's in-house brews and shares a similar menu. There are no TV's, no sports memorabilia (which is rare for this city), and no big booths for large groups. This place is all about being a cabaret with the focus on the musicians. Mind you this isn't a bad thing, just note that if you want a bar, go next door or across the street to Dave and Busters. I'd say Sing Sing holds about 150 people seated.\n\nThis particular night they were hosting a (shocker) NYE's party. For $40 bucks a person you got a choice of two entrees (beef tenderloin tips or lemon chicken), veggies, mashed potatoes, one free drink coupon, a midnight champagne toast, and, what turned out to be over four hours of non-stop music. Again... Pretty Cool.\n\nThere were three musicians holding down the fort playing more than just piano (drums, electric synth, bass guitar, and apparently I missed the sax). There was plenty of crowd involvement. As in most piano bars you request songs along with a tip. The larger the tip, the better chance of hearing your song you have. I put three requests on a sheet with a 10 and managed to get two played. Their rendition of Toto's Africa was fantastic and surprisingly, my curve ball got hit out of the park when one of the guys actually knew the tune and words to the Theme from TV's \"Growing Pains.\" I was sold from that point on.\n\nI will take this time to note that this is NOT a family friendly joint. I'm not sure if it was 21+ only but I certainly wouldn't bring anyone too young to drive. A good amount of sexual refrences and strong language awaits you.\n\nDrinks were stiff and not horribly overpriced. I think rail mixed drinks were $7.00 and beers were 6 or so (RBB doesn't brew anything I particularly enjoy so I stuck with rum and cokes). All and all my bill wasn't scary and I'm not used to that on Dec 31st. Waitress staff was really nice and incredibly attentive. No complaints there. \n\nThe only down side to everything was group seating as you're sitting at 2-top cab tables. It was easily fixed though as the group next to us was up for rearranging tables from side to side to front to back (allowing us to talk and share food/booze etc), also, being a tourist, we had no idea how hard it would be to get a cab in Homestead. Understandably NYE has its issues with cab availability but we had to wait 2.5 hours for a cab because, as we found out, Homestead is a very suburban community right outside of the city and everyone drives. \n\nOoops!\n\nAll and all a good time and someplace I'd certainly return to if for any reason I'd be back in Pittsburgh... as long as I have a car.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "_vS9qNQvx8wVUOIkj4qfAg", "review_id": "39g2XybQLeCqDwas70SZdQ", "stars": 2, "date": "2011-03-21", "text": "In my opinion, Sing Sing is really not worth it. It gets expensive because you drink, maybe start to sing a few lyrics, drink some more, think of a song you wanna hear, put $5 and title of said song on a piece of paper, you drink, they play it, everyone else is trying to get their songs played so you put $10 on your next sticky note...and so on and so forth. I wasn't really into it when I first got there but as the night went on and lager went in I started to warm up to the place. I feel that if I have to drink in order to have a good time, it's not worth it. But again, that's just me.\n\nThe 2 stars are for the piano players, who are entertaining and very talented, and the Rock Bottom brews they serve.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "3Ngk2ziLJzEGs144XhRxIA", "stars": 4, "date": "2011-03-21", "text": "So.Much.Fun! \n\nI WISH I could play a song at the drop of a hat. Too bad I never took piano lessons and I'd probably end up mumbling half the lyrics other than the chorus. Unless it's Salt n' Pepa's Shoop. \n\nThis is a really great place to go when you have out of town guests or are looking for a fun place to take someone for a birthday celebration or a fun night out. It's just something different to do other than boozing it up at the bars on a Saturday night. \n\nKeep in mind you'll be paying around a $5-10 cover plus whatever drinks and food you get. The good thing is the food is coming from the attached Rock Bottom Brewery. So a lot of it is restaurant quality good. Plus the brewery beer is actually pretty good! OF course you will be paying restaurant price drinks...so of course they're up charged a bit. But you do pay for the whole experience....so you gotta get into the spirit with some spirits! \n\nThe guys who play are incredibly talented. There's 2 guys that will take requests and play songs on the piano. They pretty much play ANYTHING you ask. Contemporary songs, throw back songs, fight songs, rap songs, pop songs. You name it, they play it. \n\nMy favorite part is when they switch out to another two guys. They'll all four get on stage and play two piano's, a guitar and drums. They usually rock out with some fun familiar songs (um, Journey, of course!). \n\nThe birthday song is seriously the best. They sing to you....and call you some names....with expletives. But in a totally nice way of course. You just have to go!", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 5, "useful": 4, "cool": 4}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "Y8CsvVEZH3PyxTCuKXTvzA", "stars": 3, "date": "2011-10-11", "text": "Dueling piano bars in Pittsburgh started at Station Square, and they died out. Then when the chain restaurant magnet \"waterfront\" opened in 2000 the parent company of The Rock Bottom Breweries decided to open Sing Sing in back of The Brewery.\n\nWhen it first opened it was pretty cool. The very first house band could put on a show that led to standing ovations. I know, I was there. From Stairway to Heaven to Free Bird, Stayin' Alive to She's My Cherry Pie, Elton John to the Boss, they were amazing at sounding like the bands they were covering. Equally incredible were the obscure songs that audience members would shout out, songs only you though you knew, and they would effortlessly sing a good portion of the song, sounding like the band who's song they sung.\n\nBut today, Sing Sing seems like it's stuck in the early part of the 21st century. The whole dueling piano, shout out a song to stump the band, Sing us a song you're the piano man has run it's course. I don't hate Sing Sing, but I could never come here more than once a year. It's a been there, done that kind of place.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "on6y4M6Vh0GlNfcH8SnbHA", "review_id": "-0m63-bqe6KXe43BinxWLw", "stars": 5, "date": "2011-10-12", "text": "If you want to be wowed by musical talent and want to laugh all night, go to Sing Sing :) If you send a dollar up with a song request, they will play it. If they don't know it, they will ask for the person who put the request in so they can sing something else they like, or they will look up the lyrics and sing it!! They aim to please :) I have definitely been pleased :)", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "on6y4M6Vh0GlNfcH8SnbHA", "review_id": "rKNIRk_K8JFsYHEEva-MWQ", "stars": 5, "date": "2011-10-14", "text": "Sing Sing is awesome!! Give a buck or more and they will play anything, and if they don't know it, they will search for who requested the song so they can do something else the person will enjoy! :) Great humor too!! :)", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "bSkco4ZdB7REFtDsJUVrDA", "review_id": "PN6TIKg9nQZ5FaGeSET-Cw", "stars": 5, "date": "2013-01-08", "text": "What a great time!  This place was awesome!  I wish I lived right down the road, because I could see myself being a regular here.\n\nHonestly, these guys have got some talent, like real talent.  They can play the piano, sing, play guitar, and the drums.  Did I mention that they are all pretty hilarious, too.  I'd easily pay the $7 cover to get in here any day because it really is worth it.  \n\nI am sure I will be back in no time at all.  Next time, I am bringing a big group of friends.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ytgLwKzD6B4af5vW56RpJg", "review_id": "5bBzqjUTYSp9yn4mx-uqFA", "stars": 3, "date": "2013-04-23", "text": "Came here with a group of girls and didn't have a reservation. We paid the cover, walked in and it was absolutely packed. There was nowhere to even stand. One of our friends was having issues with an expired license and when we found out that not all of us got in, they let us get our $7 cover back without issue. \n\nI recently went with a big group who had reserved about 50 seats. People who were not in the group kept coming in to the reserved area but the staff was very helpful in dealing with the group. \n\nThey brew their own beer so do not expect to see any known brands. There are only about 6 beers on top, so if you are more of a light beer drinker you might not be too happy with the beer choices. They also have mixed drinks and wine. The mixed drinks around about $9 and they have a limited number of bottled wines (despite what it says on the menu). \n\nThe entertainment was great and I would recommend it for a group outing. But definitely make sure that you have a reservation.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ozcqOOvFpMvALws8iox3JA", "review_id": "XMvb6dPz9QokzZd3GZX1QQ", "stars": 2, "date": "2013-06-10", "text": "This place has gone significantly down hill.  I've gone to Sing Sing about once a year for the last 6 or 7 years.  When we started going there you couldn't get a seat unless you got there early.  It was always packed.  However, each year the crowd seems to get smaller and smaller.  Crowd is an important component of a piano bar due to the interactive nature of it all.  I was there last Saturday night (8/4/12) and there was about 20-30 people there.  Very slow and boring.  It appears the crowd is no longer allowed up on stage, taking a lot of the interactive fun out of what this place used to be.  This was likely my last time at Sing Sing.  Save your $7 and skip this place.  A real shame because this place was once a lot of fun.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ta5nM41kf1a8FNqV_z4P0w", "review_id": "zxZ3RU0BZRllhny5AewDqA", "stars": 4, "date": "2013-10-13", "text": "Had an absolute blast!! Great for any crowd, any occasion, any age! Ashley the waitress was AMAZING", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "w16jpVr-b-0gd6YHwnIarg", "review_id": "Z3pPo5xNko8KeieelkSadQ", "stars": 4, "date": "2013-11-27", "text": "Picture Billy Joel's \"Piano Man\" DOUBLED mixed with beer, a rowdy crowd, and comedy - Welcome to Sing Sing!  A unique musical experience found in Homestead.\n\nIf you're looking to grab a bite to eat or a beer, come on in!  Serving food and brews from Rock Bottom Brewery, Sing Sing keeps your tummy full while you listen to two (or more) amazingly talented pianists take your musical requests.  They'll play anything you'd like, for tips of course.  Wanting to hear Britney Spears?  Toto?  Duran Duran?  Yep, they play that... new or old.\n\nThe crowd makes the show, so make sure you come ready for a good time.  If the crowd is dead, it's harder for the Guys to get a reaction.  If you're wanting to have some fun, it can be a GREAT time!  It's the perfect place for Birthday parties - especially if you want to embarrass a friend.  The guys will bring them up to the pianos and perform a little ditty.  For being a good sport, you get the coveted Sing Sing bumper sticker.  Now who wouldn't want that?\n\nDueling Pianos and brews... time to Shut Up & Sing Sing!", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y60GNpBlMkORQum9GYNfEw", "review_id": "hhEG9RvTmoiB7dDb9VMi-Q", "stars": 4, "date": "2013-12-01", "text": "First time here tonight and I must say I wasn't sure if I wanted to go. It seemed like it might be ok but nothing special but I decided to go with friends and man did I have a blast. The $7 door charge was great figuring u had music from 8 until probably 2 am ( we left shortly after 1). The food was not super but good prices reasonable. The beer left something to b desired as they r a micro brewery so u can only get their crafts. I asked for something similar to yeungling but what I got was nothing like it. The musicians were great they made this place awesome. We will b back and this may b our new Pittsburgh hangout", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fVCwHdAELZAa_YuderbTdg", "review_id": "Icibp_CoXkmfZzqM-vsdnA", "stars": 5, "date": "2014-01-20", "text": "Went here for the first time this past weekend. Needless to say I'll be returning! It was a blast!!!\n\nIt was cheap to get in and since we got there a bit earlier we got a semi-good table. Though it was very annoying that people had reserved tables right up front and never showed up. WHAT IS WRONG WITH THESE PEOPLE?! Everything if you ask me! Seriously though if you're going to reserve a table, you better freaking go! \n\nI had no complaints about the place itself! The guys were hilarious and watching my brother get made fun of multiple times was just the cherry on top! Anddd this has to be the only place I've ever enjoyed being around people who were sloppy drunk, because the comedians take no prisoners! \n\nI did enjoy when Matt and Joey were the ones up there because they are just amazing and make it so much better! They are great at what they do. Can't wait to go back!", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "_f-Vd7RXlwd03jEzzLetOg", "review_id": "Gk8PYxCfvlp2VKnhGCAhpQ", "stars": 4, "date": "2014-02-02", "text": "My friend is a piano teacher, so I took it as a good sign that Sing Sing would be quality stuff. It was her birthday, and I didn't really know anything about dueling piano bars. I was picturing glossy black grand pianos with glittering notes, pianists in black jackets and crystal glasses full of red wine. I am really, really glad I was wrong. \n\nIt was gritty, bawdy and quintessentially Pittsburgh. First off, the pianos are scuffed to hell, considering the number of tipsy people who sit on them nightly while being mildly humiliated. The musicians hammer away at them, and they're covered with N@ and Sing Sing stickers. It's obvious they've been well-loved. The music is anything but the elevator music I was picturing; it's rock, hip-hop, oldies, pop, and just about any genre imaginable thanks to the request system (send up a piece of paper with some money) and the amazing repertoire of the musicians. For instance, \"Rubber Ducky\" and \"Gangsta's Paradise\" were both featured when I was there, and both performed impeccably. They also honored a request for a Taylor Swift song only to receive $30 and a request for \"anything else,\" which they promptly followed. The musicians also do funny versions of popular songs, and throw in things like \"yinz\" instead of \"you.\"\n\nI saw in awe of the performers for a decent portion of the night. It must take a particularly special type of person to put on a show like this, considering the energy, confidence, wit, empathy, boldness, silliness, cleverness, and sheer talent a job like this requires. They rotate performers in and out so there's not even an intermission. I've read comments about the baseness of the humor, but I had no doubt the guys up on stage were intelligent dudes. They had great personalities: one was about 140 pounds, cheeky, and quick-witted. He acted out every sport in the winter olympics, and was pretty into this 90-something-year-old lady in the audience called Joan. The other had crazy hair and bright blue Chucks, beatboxed as well as he sang, and made it point to play a handful of songs for my friend's birthday. \"I think Ray Charles is the most soulful guy of all time,\" he said when she requested him.\n\nThere were tons of people celebrating birthdays, and one big bachelorette party the Saturday night I was there. The performers bring the birthday boy/girl, bachelor/bachelorette, etc. on stage (for a $20 tip, which is pretty easy to scrounge up among friends) and humiliate the hell out of them, i.e. this is not the place to be if you can't laugh at yourself. My friend had a short dress on when she sat on the piano, and they sang a three-minute song about her vagina.\n\nLuckily, the show eclipsed the bad service and overpriced, weak drinks, because those did feature heavily throughout the night. The rest of the staff was friendly, however, and I stumbled on the door guy singing and dancing by himself, which made me smile.\n\nSing Sing is definitely not an every weekend type of thing (much like Hofbräuhaus), but is a splendid way to celebrate a special occasion. Definitely belongs on every required Pittsburgh experiences list.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "ckLyJAIbb4Do-ymu8fwMQQ", "review_id": "XjePxWvcSvDMGvm5bpGMEg", "stars": 4, "date": "2014-08-30", "text": "Always a good time, although it's definitely not a place I would visit often. It's great for groups....which is quite obvious since there are always several folks there for bachelorette  parties and birthdays. \n\nShut out to the piano players, who can not only play the piano, but also sing, play the drums and the sax. They are funny and know how to keep a crowd entertained. Also know some pretty obscure songs. \n\nMy big criticism is the set up. If you don't have a reservation and/or come later in the evening, it's difficult to get seats. Believe me, I don't mind standing, but it does become a bit awkward when you have to keep scooting over to let waitresses and patrons past you. If you do find a seat, it is often littered with someone else's empty glasses.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mt-HIc3ki8oEiGyQK2LHEw", "review_id": "mHOQp6BJxgFNwJgQgozKaw", "stars": 3, "date": "2014-09-07", "text": "The musicians at this place work hard to entertain the crowd, so I can't say they are all bad.  However the minimum for a song request is $5.  I spent $20 on a song for my girlfriend and they NEVER played it!!  They were playing songs for $5 and $10, but my $40 got me no where.  Even if they didn't know the song, which I doubt, they could have picked one they knew and improvised,  my tip, save your $$ on the requests.\n\nOtherwise it's fun for special events every once in awhile.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UoIVK-Q9iw0hzbvml0kPkw", "review_id": "ppHUXqzfZK5XUIWo6wZXkw", "stars": 2, "date": "2014-10-19", "text": "I went here with a bachelorette party. We had reservations, which was good because it was packed that Saturday night. The performers were very talented, but the acoustics were strangely off.   The theme that ran through the whole show was, to quote some phrases they kept repeating, \"you bitch, you slut, you whore\" and  \"twinkle twinkle little slut, why don't you take it up the butt\" which one of the pianists wrote on the mirror at the back of the stage... You get the idea?  Perhaps if I had not been the designated driver, alcohol would have made these jokes funny the fifth, sixth, seventh time. Or maybe not.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S-cLXeiWkUVnCDPEtu55Vw", "review_id": "9ZKOzKuxIM_DgKC8bb3wWg", "stars": 1, "date": "2014-11-28", "text": "He was incredibly sexist/homophobic. He could barely play the piano and when we finally recognized a song we could actually dance to he literally asked me to get off stage because he didn't like another on stage who could actually dance with the girls.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UeYvqmyUICiVnUbN4BLEpg", "review_id": "Y_0ZwLiYoySl577SVY0g2w", "stars": 3, "date": "2015-01-02", "text": "Pretty fun place to go every once in a while, but, believe me, by the end of the night you'll be ready to go. The show lasts around 5 hours, by the 3 hour mark you'll be sick of sitting there in the crowd with your $9 a pop drinks listening to the same dirty jokes over and over and over again.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BT49cqklg9p9VZGsx37oFA", "review_id": "DqmXbr8mTMUk6LZOv4toFw", "stars": 3, "date": "2015-01-03", "text": "My best friend took me to Sing Sing for my bachelor party. I had a blast. The musicians (dueling pianists) made fun of me in a bunch of songs. They also were really good at playing requested tunes (rock). When the show was over we shuffled across the hall to the connected \"Rock Bottom\" restaurant for some grub. We all had so much fun that we went back for my buddy's bachelor party.\n\nThere were some drawbacks though. We went on a Thursday night so the atmosphere was lacking as the place was pretty empty. And of course they are a little pushy soliciting tips when the place is empty. But it's not our fault the place is empty on Thirsty Thursday, if their drinks weren't so damn expensive maybe more people would show up. And sometimes they used vulgar language which was just unnecessary since they would have otherwise still been hilarious. Also there was no table service, and the only bartender was a bitch. I'll probably be back, but only for a special occasion when I can afford it.", "type": "review", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TbUzjXVKCWTEW1W56Ayiyg", "review_id": "7GsV1mb0FhFwfWCLwhpGGg", "stars": 5, "date": "2010-08-30", "text": "I brought my car here in 2006 for repair of a scratched bumper.  The damage was minimal, but the work required removing my entire bumper for repainting.  The staff were very helpful in explaining my options and presenting me with a few choices to get the most bang for my buck.  They completed the work in the quoted amount of time and did a great job.  A few weeks later, I noticed a spot that needed touched up and they handled it immediately and without question.  I would definitely recommend these guys if you need bodywork or paint work done.", "type": "review", "business_id": "0hrB2iwQZ52VZcZWYywXrA"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "7p_AX1rONM-fVoHafapFOA", "review_id": "WLHpgWb5zIbRqbQYYwcfCw", "stars": 5, "date": "2010-12-12", "text": "I was so pleased with the quality of customer service at this body shop, from the very first time I took my car in for an estimate to a couple months down the line when I got my car repaired (they still remembered me!). One thing I really like is that they always pick up the phone. You wouldn't believe how annoying it is when businesses don't do this during normal business hours. They're so personable and gave me an honest quote that I couldn't turn down because it was the lowest in town (I checked out 5 places). They just really made this process painless and smooth. I believe it's a family-run business, and boy does it show in their hospitality.\n\nFran and Jason were the ones that I worked with -- extremely knowledgeable and patient, especially with a customer like me who wants to make sure all the paperwork is thorough and calculations are accurate. Joe DiIorio's (with an \"i\" not an \"l\") Auto Body also works closely with Enterprise Car Rental down the street, so they came and picked me up. Those guys down there have a great relationship with this body shop as well and were really accommodating.\n\nOverall, the quality of their work is amazing. I had a large dent on the driver side front bumper and had to replace my light (they ended up getting an OEM light instead of the aftermarket one because it didn't match) and get a brand new bumper. They blended the paint for me, washed, waxed, and vacuumed my car, AND their work has a lifetime guarantee. What can I say other than give my highest recommendation and hope other Yelpers can find this helpful, as this is how I found out about them.", "type": "review", "business_id": "0hrB2iwQZ52VZcZWYywXrA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e8uuGBPPcTuOJvNrP4rYNQ", "review_id": "wcOQfhi6RCXJ7e0zFlvENg", "stars": 5, "date": "2011-03-08", "text": "From my first phone call to Joe Diliorio's, I was impressed. Every staff member I spoke too was kind and eager to help. I was treated like an important client even though my car needed only moderate repairs from a low speed collision. I was able to bring my car in right away for an assessment of the damage. Joe Dilorio's took care of everything from that point on. They dealt directly with my insurance company, ordered the parts (even getting new parts instead of the used ones my insurance company wrote the estimate for, at no cost to me), and gave me a call when all the parts came in. I then brought my car back to them and they completed the repairs in a timely fashion. When I arrived to pick up my vehicle, I was pleasantly surprised to see that they had vacuumed, washed, and waxed my car! Most importantly, the repair work was absolutely top notch. They masterfully blended the paint to match older parts with newer repair parts. My car looks even better than before the wreck!\n\nIf you don't want any hassle, want to be treated with respect, and want your car looking fantastic, give these guys a call!\n\n-Adam", "type": "review", "business_id": "0hrB2iwQZ52VZcZWYywXrA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x9QRxxlj6UpzxxFQxdniHw", "review_id": "gK3azDQDC6-blkxHVssf-w", "stars": 5, "date": "2012-03-18", "text": "Joe Dilorio's Auto Body Shop was so helpful when I needed to get windows replaced. The were able to give me a lower quote then competing auto body shops in the area. They were also incredibly friendly and a pleasure to do business with. I'm planning on taking my car here for all future auto needs.", "type": "review", "business_id": "0hrB2iwQZ52VZcZWYywXrA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Qm6b5rQofNT_nyxr0yVerQ", "review_id": "o-WS4WEiRhWyous91jCN4Q", "stars": 5, "date": "2014-05-22", "text": "This is the best place we've ever taken our cars to. Their customer service is outstanding. It appears that they really like doing what they do because they are always willing to explain everything in detail. I also like that they don't over charge. I completely trust them to be honest and do the best job possible.", "type": "review", "business_id": "0hrB2iwQZ52VZcZWYywXrA"}
